{"id":250952,"date":"2023-05-30T09:47:47","date_gmt":"2023-05-30T09:47:47","guid":{"rendered":"https:\/\/foreignaffairs.gov.ng\/?post_type=officer&#038;p=250952"},"modified":"2023-12-22T08:36:29","modified_gmt":"2023-12-22T08:36:29","slug":"honourable-minister","status":"publish","type":"officer","link":"https:\/\/foreignaffairs.gov.ng\/officer\/honourable-minister\/","title":{"rendered":"H. E. Amb. Yusuf Maitama Tuggar, OON."},"content":{"rendered":"<p>Ambassador Yusuf Maitama Tuggar was born on 12th March 1967 to the family of late Senator Abubakar Tuggar of Udubo, Gamawa Local Government Area of Bauchi State. Prior to his appointment, he was Nigeria’s Ambassador to Germany from June 2017 to August 2023. His Excellency Amb. Tuggar was sworn into office as Minister of Foreign Affairs by President Bola Ahmed Tinubu on 21st August 2023.<\/p>\n<p>In addition to being a seasoned Diplomat, he is a successful businessman, a philanthropist, and an astute politician who has served the country in various capacities. He was a Member of the House of Representatives for Gamawa Federal Constituency from 2007 &#8211; 2011. He actively contributed to various Committees in the House of Representatives. These included House Committees on Foreign Affairs, Public Procurement; Petroleum (Upstream); Legislative budgeting; Agriculture; Public Petitions; Labour; and Interior.<\/p>\n<p>The Honourable Minister equally has an impressive educational background. He has a Masters Degree in International Relations from the prestigious University of Cambridge in the United Kingdom. He holds a Bachelor&#8217;s Degree in International Relations from the United States International University in San Diego, United States of America. He did his advanced-level studies at Saint Bede&#8217;s School in East Sussex, England. He had his secondary and primary school education in Kwara and Kano States of Nigeria respectively.<\/p>\n<p>Ambassador Tuggar is happily married with children.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ambassador Yusuf Maitama Tuggar was born on 12th March 1967 to the family of late Senator Abubakar Tuggar of Udubo, Gamawa Local Government Area of Bauchi State. Prior to his appointment, he was Nigeria’s Ambassador to Germany from June 2017 to August 2023. His Excellency Amb. Tuggar was sworn into office as Minister of Foreign Affairs [&hellip;]<\/p>\n","protected":false},"featured_media":251179,"template":"","acf":[],"_links":{"self":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/officer\/250952"}],"collection":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/officer"}],"about":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/types\/officer"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media\/251179"}],"wp:attachment":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media?parent=250952"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}