{"id":251698,"date":"2024-08-16T16:00:29","date_gmt":"2024-08-16T16:00:29","guid":{"rendered":"https:\/\/foreignaffairs.gov.ng\/?p=251698"},"modified":"2024-08-23T11:02:58","modified_gmt":"2024-08-23T11:02:58","slug":"251698-2","status":"publish","type":"post","link":"https:\/\/foreignaffairs.gov.ng\/251698-2\/","title":{"rendered":"State Visit to Equatorial Guinea."},"content":{"rendered":"<p>Joint Statement on the State Visit of President Bola Ahmed Tinubu to Equatorial Guinea. At the invitation of His Excellency OBIANG NGUEMA MBASOGO, President of the Republic of Equatorial Guinea, His Excellency BOLA AHMED TINUBU, President of the Federal Republic of Nigeria, paid a State Visit to Equatorial Guinea, from 14th to 16th August 2024, leading a high-level delegation.<\/p>\n<p>2. This visit was part of efforts to strengthen the robust and friendly relations at both bilateral and multilateral levels. The two Heads of State used the opportunity to explore areas of cooperation and partnership, as well as to discuss economic growth, security and stability in Africa. They expressed their firm will to promote stronger ties to boost economic development and diversification for common interest and mutual benefit.<\/p>\n<p>3. In this regard, the Heads of State applauded the signing of the bilateral Agreement on the construction and operation of the Gulf of Guinea Pipeline, which will facilitate trade in natural gas between the two countries and global markets. In addition, this Agreement will facilitate the development of gas resources, accelerate industrialisation and enhance energy security.<\/p>\n<p>4. Both delegations committed to holding the Sixth Joint Cooperation Commission as soon as possible to facilitate the signing of additional bilateral agreements, while monitoring the implementation of Agreements that have already been signed.<\/p>\n<p>5. During the exchanges, His Excellency OBIANG NGUEMA MBASOGO expressed support for efforts by the Economic Community of West African States (ECOWAS), under the Chairmanship of His Excellency BOLA AHMED TINUBU, to unite and reposition the regional bloc.<\/p>\n<p>6. Concerning the continent, the two Heads of State expressed their concerns over insecurity, instability and emerging crises across Africa. They reaffirmed the need to promote African-led solutions to African problems and committed to limiting foreign interference in the continent.<\/p>\n<p>7. The Heads of State unreservedly condemned terrorism and piracy and resolved to work together more closely to tackle these threats. To this end, they agreed to explore various initiatives tabled by Gulf of Guinea Commission Member States aimed at improving coordination and enhancing maritime security. They further reaffirmed their commitment to the Malabo Declaration on Terrorism and Unconstitutional Changes of Government in Page of 1 2 Africa, and the Abuja Process for Consolidating Regional Counter-Terrorism Approaches.<\/p>\n<p>8. At the international level, both Heads of State expressed their firm willingness to support initiatives for the prevention and peaceful resolution of disputes, as well as respect for the principles of independence, sovereignty and non-interference in the internal affairs of States, in line with the Charter of the United Nations.<\/p>\n<p>9. Both delegations committed to redoubling their efforts to support the United Nations 2030 Agenda and the African Union’s Agenda 2063. They also strongly reiterated calls for an African Permanent Seat on the UN Security Council.<\/p>\n<p>10. At the end of the visit, His Excellency BOLA AHMED TINUBU, expressed his gratitude for the warm and fraternal welcome accorded his delegation and extended an invitation to his Equato-Guinean counterpart to visit Nigeria. His Excellency OBIANG NGUEMA MBASOGO, has gladly accepted the invitation, the date of which will be communicated in due course through diplomatic channels.<\/p>\n<p>11. Done in Malabo, on the fourteenth day of the month of August of the year 2024, in two copies of the Spanish and English languages, both texts being authentic.<\/p>\n<p>Signed.<\/p>\n<p>His Excellency Yusuf Maitama TUGGAR<\/p>\n<p>Minister of Foreign Affairs<\/p>\n<p>FOR THE GOVERNMENT OF THE FEDERAL REPUBLIC OF NIGERIA.<\/p>\n<p>His Excellency Simeon Oyono ESONO ANGUE<\/p>\n<p>Minister of Foreign Affairs, Cooperation<\/p>\n<p>FOR THE GOVERNMENT OF THE REPUBLIC OF EQUATORIAL GUINEA.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Joint Statement on the State Visit of President Bola Ahmed Tinubu to Equatorial Guinea. At the invitation of His Excellency OBIANG NGUEMA MBASOGO, President of the Republic of Equatorial Guinea, His Excellency BOLA AHMED TINUBU, President of the Federal Republic of Nigeria, paid a State Visit to Equatorial Guinea, from 14th to 16th August 2024, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":251699,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[12],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/posts\/251698"}],"collection":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/comments?post=251698"}],"version-history":[{"count":3,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/posts\/251698\/revisions"}],"predecessor-version":[{"id":251707,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/posts\/251698\/revisions\/251707"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media\/251699"}],"wp:attachment":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media?parent=251698"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/categories?post=251698"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/tags?post=251698"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}