{"id":251629,"date":"2024-07-22T20:00:00","date_gmt":"2024-07-22T20:00:00","guid":{"rendered":"https:\/\/foreignaffairs.gov.ng\/?p=251629"},"modified":"2024-07-24T12:44:20","modified_gmt":"2024-07-24T12:44:20","slug":"ambassador-yusuf-maitama-tuggar-urges-au-to-reflect-on-the-current-realities-of-african-countries","status":"publish","type":"post","link":"https:\/\/foreignaffairs.gov.ng\/ambassador-yusuf-maitama-tuggar-urges-au-to-reflect-on-the-current-realities-of-african-countries\/","title":{"rendered":"Ambassador Yusuf Maitama Tuggar Urges AU to Reflect on the Current Realities of African Countries"},"content":{"rendered":"<p>The Honourable Minister of Foreign Affairs, Ambassador Yusuf Maitama Tuggar has urged the African Union to reflect on the current realities of African countries with the view of strengthening the continent’s unity and development agenda. Tuggar also called for a reconsideration of the proposed 2025 Budget of the African Union (AU) to reflect the current realities facing the continent. Tuggar made the call during the consideration of the report of the 48th Ordinary Session of the Permanent Representatives Committee (PRC) at the 6th African Union Mid-Year Coordination Meeting between the African Union (AU), Regional Economic Communities (RECs), and Regional Mechanisms (RMs) held in Accra, the Republic of Ghana. Tuggar Stated that &#8220;The 2025 Union Budget should prioritize virtual meetings and more AU meetings at Headquarters, reflecting the Union&#8217;s current realities and capacity to pay. The budget should mirror the Union&#8217;s strategic priorities, and these parameters should be included in future budgetary initiatives.&#8221; Highlighting Nigeria&#8217;s position, the Minister stated, &#8220;Nigeria emphasizes the need for standardized grading of positions for AU entities&#8217; heads and the expedited completion of the Skills Audit and Competency Assessment process. The Commission should implement audit recommendations without exceptions to prevent financial loss. Eligibility criteria should be included in recruitment processes to prevent unnecessary participation.&#8221; Equally, on the implementation of the Pan-African Parliament, Ambassador Tuggar encouraged the Commission to expedite the remaining aspects of the decision. He noted, &#8220;The implementation of the roadmap for the theme of the year is crucial. Nigeria is particularly pleased to see collaborative efforts with partners that focus on education, which should remain the desideratum of the AU&#8217;s aspirational &#8216;Agenda 2063 of the Africa We Want.&#8217;” He further opined that &#8220;Nigeria calls on the Commission to expedite the implementation of the Council&#8217;s Decision on the Pan-African Parliament and the roadmap for the theme of the year, &#8216;Justice for Africans and People of African Descent through Reparations.&#8217; The African Commission on Nuclear Energy faces challenges, and the feasibility study for the Development Fund for the Second Ten-Year Implementation Plan of Agenda 2063 is encouraged.&#8221; The Minister also called on member states, partners, and the AUC to prioritize the achievement of all aspects of the roadmap towards the actualization of the Africa We Want in the 21st century. He also drew attention to the importance of implementing audit recommendations without exceptions to prevent financial loss and stressed the inclusion of eligibility criteria in recruitment processes to prevent unnecessary participation. He expressed concern over the lack of consensus on the AU Partnerships Policy and Strategic Framework (AUPPS) and noted that its successful adoption would pave the way for more effective partnerships.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Honourable Minister of Foreign Affairs, Ambassador Yusuf Maitama Tuggar has urged the African Union to reflect on the current realities of African countries with the view of strengthening the continent’s unity and development agenda. Tuggar also called for a reconsideration of the proposed 2025 Budget of the African Union (AU) to reflect the current [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":251630,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[15,14],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/posts\/251629"}],"collection":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/comments?post=251629"}],"version-history":[{"count":1,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/posts\/251629\/revisions"}],"predecessor-version":[{"id":251631,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/posts\/251629\/revisions\/251631"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media\/251630"}],"wp:attachment":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media?parent=251629"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/categories?post=251629"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/tags?post=251629"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}