{"id":135,"date":"2022-03-12T13:58:09","date_gmt":"2022-03-12T13:58:09","guid":{"rendered":"https:\/\/foreignaffairs.gov.ng\/?page_id=135"},"modified":"2023-04-18T14:28:59","modified_gmt":"2023-04-18T14:28:59","slug":"nigeria-history","status":"publish","type":"page","link":"https:\/\/foreignaffairs.gov.ng\/nigeria\/nigeria-history\/","title":{"rendered":"History"},"content":{"rendered":"<p>The name Nigeria was taken from the Niger river  running through the country. This name was allegedly coined in the late 19th century by British journalist Flora Shaw, who later married Baron Frederick Lugard, a British colonial administrator. The origin of the name Niger, which originally applied only to the middle reaches of the Niger River, is uncertain. The word is likely an alteration of the Tuareg name egerew n-igerewen used by inhabitants along the middle reaches of the river around Timbuktu prior to 19th-century European colonialism.<\/p>\n<p>Nigeria today is marked by the emergence in various epochs of civilisations, kingdoms, states and empires, as well as a caliphate and colonial rule, before the founding of the Nigeria Nation-State in 1914 and its subsequent independence in 1960. Archaeological evidence from various parts of Nigeria suggests that parts of the country were occupied by man since the Palaeolithic or Old Stone Age period (500,000-9000 B.C.) and that such populations seem to have been physically and culturally contiguous with the present-day inhabitants. In the north, the most populous groups comprised the Hausa, the Kanuri, the Bolawa, the Ngizim, the Menga, the Margi, the Buduma, the Kotoko, and the Fulani who joined in the 19th Century through trade, Jihad and conquest. Of all these peoples, the Kanuri, the Hausa and the Fulani engaged in state formation and empire building process. The Kanuri people were closely connected with the people of Kanem in eastern part of Lake Chad, in which a kingdom comprising several small states emerged in about 9th Century. In AD 774, there emerged the Sefawa, who eventually came to dominate the whole Lake Chad area. The beginning of this empire coincided with the rise of Mali and Al-Kawkaw or Songhai, and with the period of Ghana’s greatness. For many years, what came to be known as the Kanuri Empire was made up of two parts, separated by the Lake: Kanem (in present-day Chad) and Borno (in Nigeria).<\/p>\n<p><strong>Hausa States<\/strong><\/p>\n<p>The Hausa people are by far the most numerous and occupy the greater part of northern Nigerian territory. They were made up of two major groups of seven states each. The first group of states included Biram, Daura, Katsina, Zaria, Kano, Rano, and Gobir, while the second group included Kebbi, Zamfara, Nupe, Gwari, Yauri, Ilorin and Kwararafa. Political and religious themes constituted the development of Hausa states up to the beginning of the 19th Century. The search for larger and more secure political entities stood out as the dominant theme of Hausa political life. Thus, from about the 15th Century, there had been intense rivalry and conflict between Katsina, Kano, and Zazzau (Zaria). Between 1500 and 1800 Century, there had been unsuccessful attempts to build lasting empires by welding together many of the numerous Hausa states. Consequently, during various phases, one power rose to pre-eminence only to be supplanted by another. During the 15th Century, Zazzau, under the legendary Queen Amina, established what the first Hausa Empire was, in effect, Zazzau dominion is said to have extended over territories as far as the Benue and the Niger and in some form over Bauchi, Kano, and Daura. Amina’s epoch was succeeded by the imposition of Borno overlordship on the Hausa states. Following the 19th Century Jihad of Uthman dan Fodio, the Fulani occupied northern Nigeria, dominated the Hausa states and established the Sokoto Caliphate. The Hausa\/Fulani territory was renowned for leather works and exported shoes to Spain through trans-saharan trade routes.<\/p>\n<p><strong>Central Nigerian Kingdoms and Empires<\/strong><\/p>\n<p>To the south of Hausa land and Borno, the number of ethnic groups was legion. Ethnic heterogeneity reached its peak in the region of Bauchi Plateau, Adamawa province. The vast majority of the ethnic groups south of Hausa land and Borno seem not to have organized themselves into closely integrated states. In this politically fragmented region, the Jukuns (Kwararafa) of the Gongola Benue valleys, the Igala, the Igbira-Panda, Nupe, the Oyo Yoruba of the savanna belt, as well as the Borgawa and the Edo were organized into comparatively powerful kingdoms and empires.<\/p>\n<p><strong>Yoruba Kingdoms and Empires<\/strong><\/p>\n<p>The Yoruba kingdoms started in about the eleventh century. The various kingdoms shared the belief that their several founders originated from Ife. The kingdom was the unit of political power. But cultural identity went beyond the kingdom to include sub-ethnic groups speaking the same dialect. Of these sub-ethnic groups, the principal ones were Oyo, Egba, Egbado, Ijebu, Ijesa, Ekiti, Ondo, Akoko, and Owo. The most successful of the Yoruba kingdoms in building up its power was the Oyo Kingdom. Taking advantage of its location, it built up a cavalry force which gave it dominance not only throughout the Oyo area, but also over the neighbouring parts of Borgu and Nupe, over Egbaland and Egbado, as well as over Dahomey and Porto Novo.  By the end of the 18thCentury, Oyo Empire had gone long way in disintegrating due to challenges to the authority of the Alaafin in the second half of the 18th century by leading civil and military chiefs. In about 1837, it collapsed completely due to civil wars and effects of the Fulani jihad.<\/p>\n<p><strong>Benin Kingdoms and Empires<\/strong><\/p>\n<p>The heartlands of the Benin Kingdom belong to the Edo group. The kingdom has almost certainly been in existence for less than a millennium. The traditions preserved by the monarchy itself traced with a fair degree of conviction to an origin around the 13th Century. Some thirty rulers are reckoned to have reigned in that span of time. Beyond that, we encounter much vaguer accounts of an earlier monarchy extending back over another thirty reigns to the supposed first settlement of the Edo in that area. Tradition insists that the hereditary order of Uzama chiefs existed in Benin before the present line of kings was established and that theirs are the oldest of all the Benin chieftaincy titles. It is also possible that there evolved from within this Edo community a paramount chieftaincy of either an hereditary or elective character which would have given Benin an early experience of kingship.<\/p>\n<p><strong>Kingdoms and Autonomous Communities of the Delta region and Eastern Nigeria<\/strong><\/p>\n<p>To the south of the Edo and the Yoruba are the people of the Delta region and the Igbo in the east of the Niger. Several types of social and political institutions are found among the peoples of the Delta region. They include the kingdoms of Aboh and Itsekiri, and the fragmented societies of the Ukwuani, Urhobo, Isoko and Ijo. The Itsekiri kingdom appears to have already developed by the middle of the 16th century. The Kingdom, ruled by an Olu and a Council of Ojoye, is very compact; it comprises the capital of Ode- Itsekiri and a few settlements scattered along the Forcados, Escravos and Benin Rivers. The Ijo, also settled in this region over several Centuries have scattered kingdoms, including the Egbema, Gbaramatu and Ogbe-Ijo around the Escravos river in present day Delta State, Nembe in Bayelsa State, etc.  Although the development of Aboh kingdom was uncertain, it was apparently powerful enough to have influence over most of the riverine clans as well as some upland clans. Intelligence Report compiled by the British in the 1930s lists Ogume, Ashaka, Amai, Ossissa, Afo, Adiai, Aso, Umuolu, Okpai, Utuoku, Akarai and Onya as some of the clans which recognized the authority of the Obi of Aboh.<\/p>\n<p>The Igbo are often categorised among the non-centralised societies. This categorisation is due to the fact that the Igbo did not come under the umbrella of a single state or evolve state system of any great size. However, in spite of this, Igbo society and culture enjoyed a basic uniformity of pattern and of cosmological and social ideas. But through their military dominance, and their position as spokesmen of the Oracle, the Aro established what amounted to a theocratic state over eastern Nigeria.<\/p>\n<p><strong>The Lagos Colony<\/strong> came into existence in 1861 following the conquest of Lagos by the British. The colony was administered by a Governor with a legislative council.<\/p>\n<p><strong>External Influences up to 1861<\/strong><\/p>\n<p>The first external influence came from trading activities of the Muslim merchants from North Africa and Arabia. The Muslim merchants carried with them to Nigeria the Koran, and converted people. These Arabs traded in gold, ivory, iron, hides, kola nuts, slaves, and gum. Two out of the four trans-Saharan trade routes connected directly to northern Nigeria. From Tunis the third route passed through Ghadames, Ghat, and the country of Aïr, down to Agades and Hausa land. Parallel to this, to the east, was the fourth route from Tripoli to Murzuk in Fezzan, through Bilma and on the territories of Kanem and Borno in the Lake Chad region.<\/p>\n<p>The Atlantic slave trade, which began in the 15th Century, was the largest intercontinental migration in world history before the nineteenth century. For 300 years, more Africans than Europeans crossed the Atlantic each year. The evolution of western-controlled plantation slavery, the revolution in maritime technology, and the movement of Mediterranean plantation agriculture out into the Atlantic basin worked together in creating the Atlantic slave trade. The economic complex sometimes called the South Atlantic System, centered on the production of tropical staples in Brazil, the Caribbean, and southern North America. The Portuguese, the Spaniard, the Dutch, the French and the English were all involved in the slave trade.<\/p>\n<p>After the abolition of the Slave trade in Britain in 1807 and in south of Equator in 1834, there followed the growth of legitimate trade stimulated by the penetration of European merchant capital into Nigeria, essential to the development of capitalism. Export of cocoa, groundnuts, rubber, palm oil, etc. to the world market was a means by which the resources of natural economy of pre-colonial Nigeria hitherto slumbering in dormant inaction were released into the sphere of circulation and utilised for the further augmentation or expansion of capital – a worldwide process of “accumulation of capital”. The result of this was a shift from European settlement on the coast to European penetration into the hinterland. This was facilitated by the exploration of the River Niger and was followed by missionary activities, conquest and colonisation.<\/p>\n<p><strong>The Nigerian Nation-state in Gestation: Conquests, Treaties and Amalgamations, 1861-1914<\/strong><\/p>\n<p>Chronologically, the conquest of Nigeria through military campaign was inaugurated by the annexation of Lagos in 1861. In 1878, Onitsha was sacked and Asaba bombarded. Similarly, by 1884, the National African Company had concluded about thirty seven treaties at the Niger territories including Atani, Onitsha, Abo, Osomala, Ndoni, Oko, Odekpe. Internal wars among the Yoruba, caused mainly by the decline of Oyo Empire and rivalry over the control of trade, gave the British the opportunities to gain political control further inside. In 1886, through efforts of British Prince of Peace Mission, led by Rev. Samuel Johnson, a treaty was signed to conclude the Ibadan\/Ekiti Parapo War. With the exile of Jaja of Opobo in 1887 his territory became part of Niger Protectorate.<\/p>\n<p>In 1892, the United African Company fought Aguleri. On 18 January 1893, the Governor of Lagos Gilbert Thomas Carter signed, at Abeokuta, a “Treaty of Friendship and Commerce” with Oba Osokalu, the Alake of Egbaland. Again, on 3 February 1893, Carter concluded a similar treaty with Oba Adeyemi, the Alafin of Oyo. These treaties opened up the Yoruba country to European penetration. In 1894, Ebrohimi, the strong- hold of Nana the Itsekiri was bombarded and Nana exiled on the accusation of slave trade and interference with free market. In 1896, an expedition was sent against Brass and the community was sacked.<\/p>\n<p>The British discovery of the use of rubber for the production of pneumatic tyre made entry into Benin forest imperative. In a major expedition mounted against Benin in 1897, the city was sacked and its treasury looted.  Shortly after the revocation of the Charter of the United African Company, and shortly after his appointment as a British High Commissioner to establish British control over Northern Nigeria, Lugard, at an impressive ceremony in Lokoja, 1st January 1900, hoisted the union Jack and declared the Sokoto Caliphate a British protectorate. Although this declaration was greeted with fierce battle, by 1906 most of the North had fallen to the British imperial forces. Resistance to alien rule gradually receded as one moved from coastal areas and the banks of major inland waterways to less easily accessible areas. Hence, new political arrangements were sought by those in control of affairs. The Salbourn Committee on amalgamation recommended in August 1898 that the British “Niger Territories” be ultimately Amalgamated. In May 1906, the Lagos Colony and Protectorate were amalgamated with the Protectorate of Southern Nigeria to form the new Colony and Protectorate of Southern Nigeria. The second installment took place in 1914 when these territories (in the South) were administratively combined with the protectorate of Northern Nigeria, giving birth to the geo-political entity that was to be named “Nigeria” (in evocation of “River Niger” and the “Area” it flows through).<\/p>\n<p><strong>Heritage<\/strong><\/p>\n<p>The history of Nigeria show cases a rich Cultural heritage. The earliest of this heritage is the Nok culture, which flourished extensively in the western part of Jos Plateau in Northern part of Nigeria between 900 BC and AD 200. Nok Culture also extended as far as Katsina, Ala, Ankiring, Kagara, Taruga and Yelwa. It was characterized by distinctive ways of making terracotta figurines mostly head of human beings. Other Nok artefacts included round stone axes, iron axe blades, small stone arrow points and barbs, quantities of pottery, among others. Not far from the Nok Culture area was the Daima culture with its simple clay animal bronze figures which were by the 6th Century BC being made by a population of Neolithic herdsmen. At the settlement mound of Diama, in north-western Borno, south of Lake Chad, the people began to build circular huts of mud which had floors made of potsherd pavements. These fired clay figures included a humped cow, sheep or goats, wild animals and human beings.<\/p>\n<p>Terracotta sculptures have also been recovered from Ile-Ife. They included the naturalistic sculpture in brass and pottery which were being produced sometime between AD 1110 and 1450. The subject matter of their work of arts included human and animal figures. Ife sculptures were made of copper alloyed with zinc and with relatively high quality of lead. Few of the objects were made of copper. The Ife sculptures have been placed around the 12th and 14th Century AD.<\/p>\n<p>Benin royal art consisted of bronze objects cast by the lost- wax process such as statuettes, stylized heads, some of which served as supports for carved elephant tusks and bas-reliefs representing historical events. Besides, the art of casting bronze, terracotta modeling also existed. Ivory was also worked with outstanding virtuosity; among the varied objects produced were complete elephant tusks decorated either with basketry, weaving or matting. By and large, Benin had a large number of objects (over 2000) most of which strictly speaking should be referred to as brass objects. The few early Benin objects have been dated to about the 13th Century AD.<\/p>\n<p>Igbo-ukwu culture consisted of a large collection of objects and regalia of an important personality and objects from shrines. The manufacturing techniques fall into two categories Perdue or lost wax technique and smiting\/chasing method. The Igbo-Ukwu culture which dated from 9th century AD contained both chased copper objects and elaborate castings of lead bronze. The earliest artistic casting from black Africa, these pieces consist of ritual vessels and other ceremonial objects with intricate surface decoration.<\/p>\n<p>&nbsp;<\/p>\n<p>source:<a href=\"https:\/\/nigeria.gov.ng\/about-nigeria\/history-of-nigeria\/\"> https:\/\/nigeria.gov.ng\/about-nigeria\/history-of-nigeria\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The name Nigeria was taken from the Niger river  running through the country. This name was allegedly coined in the late 19th century by British journalist Flora Shaw, who later married Baron Frederick Lugard, a British colonial administrator. The origin of the name Niger, which originally applied only to the middle reaches of the Niger [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":248072,"parent":133,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"acf":[],"_links":{"self":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/135"}],"collection":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/comments?post=135"}],"version-history":[{"count":8,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/135\/revisions"}],"predecessor-version":[{"id":250535,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/135\/revisions\/250535"}],"up":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/133"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media\/248072"}],"wp:attachment":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media?parent=135"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}