{"id":137,"date":"2022-03-12T14:00:54","date_gmt":"2022-03-12T14:00:54","guid":{"rendered":"https:\/\/foreignaffairs.gov.ng\/?page_id=137"},"modified":"2023-04-18T14:32:38","modified_gmt":"2023-04-18T14:32:38","slug":"nigeria-culture","status":"publish","type":"page","link":"https:\/\/foreignaffairs.gov.ng\/nigeria\/nigeria-culture\/","title":{"rendered":"Culture"},"content":{"rendered":"<p><strong>NIGERIA CULTURE AND HERITAGE<\/strong><\/p>\n<p>The Nigerian government in September, 1988, launched the “National Cultural Policy”. This policy document defined culture as “ the totality of the way of life evolved by a people in their attempt to meet the challenges in their environment which gives order and meaning to their social, political, economic, aesthetic and religious norms and modes of organization, thus distinguishing a people from their neighbour”. As a further step, the Federal Government in June 1999, created the Federal Ministry of Culture and Tourism by mid 2006, the ministry was renamed Federal Ministry of Tourism, Culture and National Orientation, with the mandate to promote the nation’s rich cultural heritage, through the identification, development and marketing, of the diverse cultural and tourism potentials. However In November 2015, Ministry of Culture and Tourism was later merged with ministry of information, which is now known as Ministry of Information, Culture and Tourism.<\/p>\n<p>The culture of Nigeria is shaped by Nigeria’s multiple ethnic groups. The country has over 50 languages and over 250 dialects and ethnic groups. The three largest ethnic groups are the Hausa-Fulani who are predominant in the north, the Igbo who are predominant in the south-east, and the Yoruba who are predominant in the southwest. The Edo people are predominant in the region between Yoruba land and Igbo land. Much of the Edo tends to be Christian while the remaining 25 percent worship deities called Ogu. This group is followed by the Ibibio\/Annang\/Efik people of the coastal southeastern Nigeria and the Ijaw of the Niger Delta.<\/p>\n<p>The rest of Nigeria’s ethnic groups (sometimes called ‘minorities’) are found all over the country but especially in the middle belt and north. The Hausa tend to be Muslim and the Igbo are predominantly Christian. The Efik, Ibibio, Annang people are mainly Christian. The Yoruba have a balance of members that are adherent to both Islam and Christianity. Indigenous are often blended with Christian beliefs.<\/p>\n<p><strong>CULTURAL DIVERSITY AND COMMON TIES<\/strong><\/p>\n<p>It is popularly believed that Nigeria has about three hundred fifty linguistic groups Language is the vehicle for creating and mastering the complex realities that define any geographical expression. It is the most dynamic element of any culture or society. Languages are vital for transmitting knowledge, world views and verbal arts over the years. These languages and the cultures they transmit are however not barriers but bridges of understanding and mutual cooperation across their respective frontiers which differentiates them as entities sometimes referred to as “ethnic nationalities”. Some super structures are known to have grown which help to mediate the diversities and channel them into harmonies and unity. This is why today we talk about “Unity in Diversity”. Examples of such include, dress modes, inter-ethnic marriages, shared religious beliefs and practices as well as commerce. People have equally developed interest in other cultures to the extent of speaking different languages and taking names from other cultures for their children.<\/p>\n<p>In the area of dressing, Nigeria is characterized by the diversity of its traditional attires. It is fashionable for Nigerians to wear the traditional dresses of their regions or ethnic groups of origin. The Igbo men from southeast geo- political region for instance are known for their red caps just as the hat is a peculiar feature of men’s traditional wears in the Niger Delta region. In Benue State the “Ange” cloth characterized by its zebra-like black and white stripes is used by the Tiv people while their Idoma neighbours wear similar clothes with red and black stripes. But it is not uncommon for Nigerians to adopt particular attires from other regions which have become very popular. The ensemble “Baban riga” (or “Agbada”), “Buba” and “Shokoto”, completed with a cap to match, or the “Kaftan” which are popular among the men-folk in the north (predominantly Hausa\/Fulani) are now worn by people from other parts of the country. In western Nigeria, the Yoruba brand of the “Agbada”, “Buba”, “Shokoto”, with the cap to match, has become popular too.<\/p>\n<p>The recently introduced attire, referred to as “resource control”, which was initially associated with men from the Niger-Delta region has today become a common outfit across the length and breadth of Nigeria. As for the women- folk, the “Buba”, “Iro”, “Gele”, “Ipele” have been adopted across the regions with minor nuances of style. Although attached to the uniqueness of the traditional attires of their places of origin, Nigerians are also simple lovers of beauty and so do not hesitate to adopt a fashion or an object of beauty that appeals to them. Most of these cloths are products of hand-woven fabrics such as “Akwete”, “Aso-Oke”, “Batik”, “Tie and Dye”, “Ota- ochi”. These materials are the vogue in the textile industry. Nigerians have carved a niche for themselves in the fashion world. The use of “Ankara” materials by both men and women sets Nigerians apart in fashion at home and internationally.<\/p>\n<p><strong>LITERARY AND PERFORMING ARTS<\/strong><\/p>\n<p>Writers and performing artistes, the world over are regarded as the “cultural engineers” of the society. This is because they help to create and lubricate the fabrics of societal stands and joints through their creativity. Literary arts in Nigeria, has enjoyed greater patronage since Independence in 1960. With the increasing documentation of folklore and traditions, the literary arts, has witnessed a phenomenal growth. This has equally given prominence to Nigerian authors and scholars within and outside the country.<\/p>\n<p>These literary icons include Wole Soyinka, the first Black writer to win the Noble Prize of literature in 1986, late Chinua Achebe, Cyprian Ekwensi, John Pepper Clark, Gabriel Okara, Abubakar Imam, Flora Nwapa, Zulu Sofola, Amos Tutuola, Chukwemeka Ike, Elechi Amadi, Chimamandia Adiche to mention these few. This development has encouraged script writers to have a reservoir of materials for film scripts used especially by Nollywood film producers.<\/p>\n<p><strong>NIGERIAN CUISINE AND GASTRONOMY<\/strong><\/p>\n<p>The Nigeria culinary practice is as diverse as the country’s ethnic groups. Every ethnic group is associated with particular cuisine which they hold as dear to them. The major traditional dishes and delicacies which have become national heritage include: Edikaikon, Okoho, Fufu, Tuwo, Akpu, Suya, Kilishi ,Gbegeri, Owo, Bush meat, Fura de nunu, Kunu, Amala, Eba, Pounded yam. Today, Nigerians from various cultures prefer these foods to the western or so called continental dishes. The popular snacks include Akara, Boli and Corn (boiled, popped or roasted). The beauty in the Nigerian experience is that guests are fed generously.<\/p>\n<p><strong>NIGERIAN ARTS AND CRAFT IN BUILDING DECORATION AND LANDSCAPING<br \/>\n<\/strong><br \/>\nIt is not particularly an easy exercise to draw a straight line of demarcation between arts and crafts. This is usually so because the same artist (genius) who produced the beautiful bronze head, could be involved in the production of ornaments of brass, just as the same carver who produced a door panel could be involved in making stool, comb or ritual drum. It is however accepted that the first product by the same artist from a mould represents an art, while subsequent products from that same mould are classified as craft, though coming from the same artist.<br \/>\nEach product is intended for a specific usage. Generally, climate, geography and religious factors play vital role in art or craft production as the main motive or idea was utility and aesthetic satisfaction. These factors are equally responsible for the decoration of such objects of everyday use, for example granary, door panels, bowls, knife handle, drinking horns, special design of the rulers roofs and walls (interior and exterior), etc.<\/p>\n<p>Nigerian craftsmen have been in their trade for over two thousand years. Their efforts are known to have produced the terra-cotta and iron smelting tradition of Nok, Ife, Igbo- ukwu and Benin bronze respectively. These high quality works of art represent the evidence of early civilization in Nigeria. The works of art enjoy patronage especially from the royal palaces and homes of wealthy personalities in the Nigerian society. Such patronage encouraged the production of state swords, sceptres, royal drums, ivory ornaments, whisks fans beaded handles, crowns and various royal regalia. A few examples may suffice.<\/p>\n<p>Calabash carving is a prominent craft practice with long standing tradition in Nigeria. For instance, Old Oyo is well associated with this practice as well as some communities in Plateau, Bauchi, Sokoto, Adamawa and Bornu states. They produced burnt or engraved geometric designs on calabashes which are widely used and marketed across the country. These crafts now enjoy patronage in many African countries. This craft item is sometimes used as wall hanging, so also are raffia based crafts.<\/p>\n<p>In the area of buildings decorated with arts and crafts, Nigeria has a long tradition of such practice. This is where door panels, wooden and stone objects are utilised as “Installation Art” pieces. It is a common feature these days to see beautiful art displays and expression on edifices across the country. Most of these designs utilise marble materials as “Mosaïc”. There are also giant art works in front of edifices, developed from wood, bronze, Iron and Fibre. An example of this art expression is the giant art work at the defunct NEPA building in Lagos.<br \/>\nIn Nigeria, landscaping appears to be incomplete without works of art. This is why most round abouts across the country are adorned with giant art pieces. Some of these works tell the tourist about the dominant cultural activities of the people of the region. For example, a tourist entering Makurdi the Capital of Benue State is presented with an art expression that this is the “Food Basket of the Nation”. These decorations depict Nigerians as lovers of beautiful environment and as people endowed with creativity.<\/p>\n<p><strong> CONTEMPORARY PAINTING AND SCULPTURE<\/strong><\/p>\n<p>The creative inspirations of early civilization such as the Nok, Ife, Benin and Igbo-Ukwu presented the foundation and platform for the creative evolution of cycles and generations of modern artists in Nigeria. Art traditions which started with traditional carvers have today metamorphosed into contemporary art with “western-trained” artists. Nigeria has since Independence produced five generations of modern artists. What started with people like Aina Onabolu has produced young artists like Samuel Onyilo, Paul Oluwole, etc.These artists were trained in Art Schools in Nigeria.<\/p>\n<p>In the area of painting, their works cover a wide range of colours and expressions. These expressions or art forms use water colours and acrylics to produce wide range of techniques. Some undertake a technique known as wood burning or mixed media. Nigerian sculptors are very outstanding in their art forms and expressions. They produce works on wood, Iron, Bronze and Stones among other features. Their works are found in major galleries and private homes globally, some of their commissioned works adorn major round-about in most cities across the country. The patronage covers private individuals, companies and government agencies.<\/p>\n<p><strong>TRADITIONAL MUSIC AND DANCE<\/strong><\/p>\n<p>The development of modern music and dance had their foundation or origins in the traditions of the various communities in Nigeria. Different communities are known to have their music and dance forms, which they use for entertaining themselves and important guests. Every occasion or event attracts its own form of music. There is music for entertaining workmen in farms drums, especially with double membrane, on hollow wood produce the music and is supported by the gong, horns and trumpets. There is music for naming ceremony, installation of kings and at burials. Both genders are involved, cutting across generations. For example the Idoma of Benue state, have the “Ajah”, Oghrinye, Odumu and Ichicha to mention a few.<\/p>\n<p>Their Tiv neighbours have the Swange and Kwagh-hir ; Atilogu and  Nkponkiti is common in southeast ; Sakara, Bata, Sato, Ponse, Yemoja, Gelede, is popular in  southwest; while Chalawa, Dabe, Goje hold sway in the northeast and northwest respectively; and Igbabo is well known in Edo State (south-south region).<\/p>\n<p>Nigeria is famous for its English language literature, apart from English language being its international language, pidgin is also a lingua franca that was common among illiterates and the street touts who cannot speak the formal English but nowadays everybody including the rich and the poor, the literates and the illiterates all speak Pidgin English which is a picture of English and other slang like ‘How you dey’ instead of ‘How are you’ and its popular music. Since the 1990s the Nigerian movie industry, sometimes called “Nollywood” has emerged as a fast growing cultural force all over the continent. All over the country, and even increasingly in the conservative north, western music, dresses and movies are ever popular.<br \/>\nEntertainment industry Nollywood and Nigerian music.<\/p>\n<p>Nollywood emerged in 1992 and quickly imposed itself as one of the world’s largest film industries. Today, it comes just behind “Hollywood and “Bollywood”, American and Indian film industries respectively. It is a unifying brand for practitioners in scripting, directing, sound, High Definition (HD) techniques, acting, cinematography, make-up, editing, etc. in Nigeria, Nollywood is the Nigerian national movie industry articulated around a few major production centres like Lagos, Onitsha, Enugu, Asaba and Abuja. The distribution of the films also hinge on these same production centres as well as other major distribution points in Nigeria such as Aba.<\/p>\n<p>The movie “Living in Bondage” by Mr. Kenneth Nnebue was the bold step that made a journey of a million miles worth embarking upon. Today, looking behind to its trail blazing achievements, Nollywood with its sister – Nigerian Music Industry, is proud to take the world stage, by identifying its relevance and essence in filling the gap created by the dearth of quality productions in the local television channels and radio stations, Nollywood has established itself as a major cultural and economic force in Nigeria and the rest of Africa. The entertainment industry which they constitute accounted for over 1.4% of Nigeria’s Gross Domestic Product (GDP) in 2013 and this figure is fast growing.<\/p>\n<p>Nollywood today boasts an impressive number of star actors and actresses as well as film producers. Suffice it to mention a few names as examples: Pete Edochie, Olu Jacobs, Nkem Owoh (alias Osuofia or Ukwa), Segun Arinze, Francis Duru, the famous duo Chidi Ikedieze and Osita Iheme, Desmond Eliot, Emeka Ike, Ojoho Ouafor, etc. are among the outstanding actors, while actresses who have become familiar house-hold names include Patience Uzokwor, Rita Dominic, Genevieve Nnaji, Ini Edo, Omotala J. Ekeinde, Ngozi Ezeonu, Mercy Johnson, Stephanie Okereke Linus, Funke Akindele, Uche Jumbo, Joke Silva etc.<\/p>\n<p>The music fact of the entertainment industry has waxed relatively strong, expanding year after year, turning in billions of naira to the economy. There is no gainsaying the fact that music is part of our every- day life and, more or less, an integral part of visual and audio media productions, including soundtracks in both local and foreign movies. With an apparently inexhaustible stream talents and capacity to innovate, the Nigerian music industry is one that can neither be hindered by economic depression nor lack relevance.<\/p>\n<p>Nigerian music has the necessary resources to rule the air waves of not only Nigeria but also the length and breadth of Africa and the world at large. It is noteworthy that the number of stakeholders in the Nigerian music business is ever increasing. The stakeholders include artistes, musicians, producers, promoters, managers, distributors, marketers, etc. In the past six years, interestingly, the growing numbers of new production studios and artistes springing up has paved way for a more vibrant and self-sustaining industry. A lot of Nigerian artistes are already enjoying cooperate sponsorship for their unique talents and achievements. Some have recorded landmark albums sale, sometimes running into hundreds of thousands of copies.<\/p>\n<p>Others have won prestigious awards in international contests and events, hence attracting more and more investments from very many sources. The investments have no doubt aided production of world class quality music as a result of innovations in sounds, rhythms and recording techniques Pace-setters, Nigerian musicians have developed a vast spectrum of music genres, blending hip-hop, rap, rhythm and blues, reggae, gospel, etc. with traditional Nigerian beats and instruments. Some of the popular names include 2-Face Idibia, P- Square, Davido, Timaya, Tiwa Savage, M.I, Bracket, Olamide, Flavour, Wizkid, D’Banj, Kcee, Asa, Skales, Don Jazzy, MC Galaxy, Yemi Alade, Patoranking, etc. A good number have also made name in Gospel music: Chris Morgan, Panam Percy Paul, Yinka Ayefele, Frank Edward, Sinach etc.<\/p>\n<p><strong>STAND-UP COMEDIANS ON THE RISE<\/strong><\/p>\n<p>Stand-up comedians have come to complete Nigeria’s entertainment landscape. They distill humour and jokes inspired by the every-day life experience of Nigerians to a wide variety of audience, through direct stage shows or recorded VCD\/DVDs, in English or Nigerian Pidgin. Among the most popular of these highly talented comedians are: I go dye, Gordons, Klint d’drunk, Basketmouth, AY, Lepasious Bose, Funny Bone, Akpororo, Seyi Law, Bovi, Helen Paul, Chi-girl, etc.<\/p>\n<p><strong>TOURISM AND HOSPITALITY INDUSTRY<\/strong><\/p>\n<p>Nigeria as country is blessed with both natural and human resources that make the country a preferred tourist destination. The rich and diverse natural, ecological and cultural resources coupled with over 177 million people in the country inform the appellation the “Giant of Africa”. These resources are spread with- in a landmass of about 932,768 km2 located wholly within the tropics and within a territory that extends about 650 miles (1,050 km) from north to south and 700 miles (1, 130km) East to West. The natural features of the country which readily attract the visitor include a warm, sunny climate, fascinating beaches and evergreen vegetation in the south; while in the north; alluring landforms overshadow wide expanses of savannah grassland. There are other interesting natural features including hill formations, waterfalls, and springs, pockets of mountainous areas with temperate-like climate and a range of unique and uncommon species of wildlife.<\/p>\n<p><strong>NIGERIA’S TOURISM POTENTIALS<\/strong><\/p>\n<p>The diverse cultural features of the country which is a manifestation of the socio-cultural differences of the over 250 ethnic groups that have inhabited the land for ages have attracted several international recognitions. Some of the big cultural events with tourism potentials include: the Grand Durbar Festival and the famous Argungu Fishing Festival in the north, the Atilogwu Dancers and the New Yam Festival in the East; the boat Regatta in Lagos and Yenogoa; the Olofin Festival in Idanre, Ondo State; the Olojo Festival at Ile-Ife; the Oshun Festival in Osogbo, Osun State; Abuja, Calabar and Rivers carnivals among others.<\/p>\n<p>The quest for ECO-TOURISM by travelers who are interested in exotic natural environment and passion for conservation efforts and observations of wildlife in natural setting has catalysed the development of such attractions. Eco-tourism attractions in the country include overland safaris, natural parks, gorilla viewing, deep sea recreational fishing, lake and river fishing, archaeological towns, beach resorts and hotels, transportation – water, land and air, exceptional beaches lined with coconut and palm grooves such as Bar Beach, Eleko Beach and Badagry, Beach. Include: the Grand Durbar Festival and the famous Argungu Fishing Festival in the north, the Atilogwu Dancers and the New Yam Festival in the East; the boat Regatta in Lagos and Yenogoa; the Olofin Festival in Idanre, Ondo State; the Olojo Festival at Ile-Ife; the Oshun Festival in Osogbo, Osun State; Abuja, Calabar and Rivers carnivals among others.<\/p>\n<p><strong>NATURAL TOURIST SITES<\/strong><\/p>\n<p><strong>Sukur Landscape<\/strong><\/p>\n<p>A UNESCO-listed World Heritage site. The Sukur land- scape lies within the Cameroon-Nigeria border- lands in present day Madagali Local Government Area of Adamawa State. The entire Sukur cultural land- scape is a scenic blend of nature and culture. The Sukur site possesses rich soils and adequate supplies of natural and spring water. The plateau is also the home of Hidi (i.e. the king). It is a strategic loca- tion from which the Sukur resisted attacks from hostile neighbours.<\/p>\n<p><strong>Zuma Rock<\/strong><\/p>\n<p>Located along Kaduna- Abuja Highway in Niger State, about half an hour drive from the centre of the new Federal Capital, this is a beautiful giant rock used for defensive purposes by the Gwari people against invading neighbouring tribes during the inter-tribal wars. The legend, it is said, goes that the indigenes in the olden days believed that a couple of depressions that form a patch on the upper part of the rock were actual- ly eyes with which it could foresee danger from the sur- rounding and warn them through oracles. Zuma rock represents a beautiful and unique granite rock forma- tion. It offers a good envi- ronment for picnicking and relaxation.<\/p>\n<p><strong>Olumo Rock<\/strong><\/p>\n<p>It is located in Abeokuta, Ogun State. Olumo rock is a massive outcrop of granite rocks of primitive formation. The highest point on the rock is about 137 metres from the base of the rock. It is a his- torical monument, which served as a shelter and fortress for the Egba people during the Yoruba inter-city wars. The centre consists of a fast food outlet, a museum, a giant telescope to view Abeokuta, a recreational park, etc. The centre has a heavy duty escalator band glass elevator running through the different levels of the rock alongside the old stairway for visitors who love climbing.<\/p>\n<p><strong>Kura Falls<\/strong><\/p>\n<p>Kura falls is located 77 km from Jos, Plateau State. It is a fascinating and exciting place to visit. The village is situated within rich savan- nah vegetation with moun- tainous ranges and lakes, providing a beautiful scenery ideal for picnic, bird watching and nature trail.<\/p>\n<p><strong>Shere Hills<\/strong><\/p>\n<p>The Shere hill is the apex of the Jos Plateau. The hill peaks at 1, 829 metres above sea level.  The hilltop presents beautiful and relaxing scenery in an area excellent for picnic, mountaineering, and sightsee- ing and camping.<\/p>\n<p><strong>Agbokim Waterfalls<\/strong><\/p>\n<p>Agbokim waterfalls is a beautiful scenic attraction. Water from the falls run into a large pool surrounded by thick vegetation.<\/p>\n<p><strong>Gurara Water Falls<\/strong><\/p>\n<p>Gurara waterfalls, best described as Nigeria’s premier falls, is located off Minna Suleja road in Niger State. It is one of the nation’s greatest holiday resorts. The fascinating periods of the falls occur when the water level is at its peak during the months of April-August. However, it is low between September and March there by giving a good view of the waterbed.<\/p>\n<p><strong>Erin Ijesha waterfalls<\/strong><\/p>\n<p>This waterfall lies some 20 km east of Ilesha Akure road. The waterfall has about five layers. The water flows among rocks and splashes down with great force to the evergreen vegetation ground. The area is also useful for mountaineering exercises. The breeze at the waterfall is cool and refreshing.<\/p>\n<p><strong>Mambilla Plateau<\/strong><\/p>\n<p>The Mambilla plateau is a table land located at Gembu in Sarduna local government council of Taraba State. The Plateau is about 1,830 metres above sea level with a temperate climate compara- ble to any temperate region of the world. The Mambilla Plateau is characterised by an undulating landscape and the clean free flow of Barup, Manchewa, Rufi, Tiba and Bambika waterfalls. It is an ideal site for high altitude sport, training, gaming, adventure, relaxation, pic- nicking, leadership training and holidaying.<\/p>\n<p><strong>Idanre and Oka Hills<\/strong><\/p>\n<p>Idanre hill is located 15km southwest of Akure, Ondo state. Idanre hill is steep sided, smooth and dome- shaped. It is an inspiring and beautiful site for tourists. Oke-Maria (Virgin Mary Hill) is located at Oka Akoko about 113 km from Akure town. It has a beautiful Virgin Mary statue at the top of the hill. It provides an attractive scenery and excellent environment for pilgrims.<\/p>\n<p><strong>Obudu cattle ranch<\/strong><\/p>\n<p>Obudu cattle ranch is about 350 km from Calabar, Cross river state. It is located at the exotic Oban Obudu Plateau which is over 5,200 feet above sea level. The ranch provides a semi-temperate climate of between 26°C (78°F) and 32°C (89.6°F), which may drop to between 4°C (36°F) and 10°C (50°F). The scenery is breathtakingly beautiful with hills, valleys as far as the eyes can see. The ranch is peaceful and close to nature: it comprises stone-walled, chalets, ranch, bar and restaurant, lawn tennis court and cable cars for utmost recreational experience.<\/p>\n<p><strong>Oguta Lakes<\/strong><\/p>\n<p>The Oguta Lake in Imo State is a lake resort complex comprising a motel, an 18 hole golf course, relics of the civil war, natural conflu- ence of Oguta Lake and Orashi river. Activities at the Lake include: boat cruising, fishing and bird watching.<\/p>\n<p><strong>Ikogosi springs<\/strong><\/p>\n<p>It is located in Ikogosi, Ekiti state, about 52 km North- West of Ado-Ekiti, Ekiti State. This is an irresistible site where warm and cold water ooze out from differ- ent sources. The springs flow side by side and meet at a spot with each main- taining its thermal identity- the first of such in the world. The natural vegetation of the spring is left untouched for eco-tourism appeal. Lekki, Mayegun and Bar Beaches<\/p>\n<p><strong>Lekki beach<\/strong><\/p>\n<p>The Oso-Lekki break water is located at Lekki Peninsula area of Lagos. It is the site for the state fishing and cultural festival.<\/p>\n<p><strong>Mayegun beach<\/strong><\/p>\n<p>Mayegun beach is splendid resort located at the beginning of Lekki peninsula. Bar beach: Bar beach is a captivating long stretch of beach, located along Ahmadu Bello way, Victoria Island, Lagos. Whispering Palms<\/p>\n<p><strong>The whispering Palm Resort<\/strong><\/p>\n<p>It is located along Badagry Expressway, Iworu-Ajido, Lagos. It is one of the exotic palm resorts in Nigeria. The resort offers classic recreational and relaxation facilities. An ideal place for camping, honeymoon, picnics etc.<\/p>\n<p><strong>PARK AND GAME RESERVES<\/strong><\/p>\n<p><strong>Yankari National Park<\/strong><\/p>\n<p>The park is located around the Gaji river in Alkaleri Local Government Area; about 110 km south-west of Bauchi State. The reserve covers an area of about 2,224.10\/km2 of savannah woodland and is stocked with elephants, baboons, waterbucks, monkeys, buffaloes, hippotamus, among several other big animals. The park is inhabited by a variety of birds such as saddle bills, herons, and eagles. Within the park is the Wiki warm spring which is one of the best features of the park.<\/p>\n<p><strong>Kuyamba Game Reserve<\/strong><\/p>\n<p>This resort is a wildlife reserve of about 10 km2 at Madada in Kuyambana, Zamfara State. The reserve is known to be a natural habitat for wild animals such as lions, tigers, hyenas, etc. It is an ideal site for game hunting, adventure, etc.<\/p>\n<p><strong>Okumu Wildlife Sanctuary<\/strong><\/p>\n<p>It has an area of about 300 km2 and is about 65 km west of Benin City, Edo state. The forest has a unique collection of animal species including the endangered white- throated monkey.<\/p>\n<p><strong>Gashaka Gumpti<\/strong><\/p>\n<p>The Gashaka Gumpti Park in Taraba State is a natural conservation of rare fauna and flora located at the foot of the Mambilla Plateau. The park is over 15 km2. The animal species include white monkeys, birds, crocodiles, etc.<\/p>\n<p><strong>CULTURAL AND HISTORICAL ATTRACTIONS<\/strong><\/p>\n<p><strong>ANCESTRAL FESTIVALS<\/strong><\/p>\n<p><strong>Durbar Festival (Katsina, Kano, Zaria, etc.)<\/strong><\/p>\n<p>This is a rich display of horses mounted by colourfully dressed caveliers, who pay traditional homage to the Emir to commemorate Sallah. It is held in some states in Northern Nigeria such as Katsina, Kaduna and Kano States.<\/p>\n<p><strong> Eyo Festival (Lagos)<\/strong><\/p>\n<p>This is a Lagos indigenous festival staged to mark the transition of an important indigene to the great beyond.<\/p>\n<p><strong>Osun Festival<\/strong><\/p>\n<p>This is an annual worship of the Osun goddess of fertility in the second week of August. It takes place in Osogbo, Osun State.<\/p>\n<p><strong>Argungu Fishing Festival<\/strong><\/p>\n<p>It is a bare hand fishing competition that is held in Argungu in Kebbi state. It also includes water sports and wrestling contests.<\/p>\n<p><strong>New yam Festival<\/strong><\/p>\n<p><strong>Ige-Agba Festival<\/strong><\/p>\n<p>This is new yam festival celebrated by the Igede people of Benue State at Oju and Obi. It holds every first week of September.<\/p>\n<p><strong> Mamanwu Festival<\/strong><\/p>\n<p>It holds every November in Enugu. It is a colourful dis- play of masquerades to usher in the new yam.<\/p>\n<p><strong>Ovie Orese Festival<\/strong><\/p>\n<p>The festival is a mandatory marital rite for virgins in Ogori land. It is a sort of initiation into adulthood. The venue is Ogori land in Kogi State.<\/p>\n<p><strong>Olojo\/Ibogun Festival (Ile-Ife)<\/strong><\/p>\n<p>This is a festival celebrated annually and it takes place every month of October in Ile-Ife. The festival is performed by worshipping and offerings at Oke-Mogun in Ile ife. The festival lasts for four days.<\/p>\n<p><strong> Igbogo Festival (Owo)<\/strong><\/p>\n<p>This is an annual celebration in Owo, Ondo State every September.<\/p>\n<p><strong>The Igbogo cultural festival<\/strong><\/p>\n<p>This is celebrated annually to usher in the new yam with pump and pageantry.<\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>HISTORICAL OBAS’ AND EMIRS’ PALACES<\/strong><\/p>\n<p><strong>Alafin of Oyo’s Palace<\/strong><\/p>\n<p>It is a historical and cultural monument described as a Yoruba museum containing relics and antiquities of the Yoruba race. The Aganju hall, the 150 year old tortoise and an expansive courtyard are some of the prominent features.<\/p>\n<p><strong>Oba of Lagos’ Palace (Iga Idungaran)<\/strong><\/p>\n<p>This is a cultural centre and the palace of the Oba of Lagos. The palace was believed to have been built in 1670.<\/p>\n<p><strong>Emir of Kano’s Palace (Kano City)<\/strong><\/p>\n<p>It is a magnificent architectural design. The palace is a settlement within a settlement. Built in the 15thcentury by the 20thEmir of Kano, it is now like a museum.<\/p>\n<p><strong>Oba of Benin’s Palace<\/strong><\/p>\n<p>Is a unique traditional architecture and works of arts dating back to the 9th and 10th centuries located near the Kings Square in Benin city.<\/p>\n<p><strong>Emir of Zaria’s Palace (Zaria)<\/strong><\/p>\n<p>Is a magnificent edifice and historical monument built some 200 years ago. The palace is built in a traditional Hausa architectural design and has endured the trials of modernity and time.<\/p>\n<p><strong>Ooni of Ife’s Palace (Ile-Ife)<\/strong><\/p>\n<p>It is among the historic monuments of the state, being the ancestral home and spiritual headquarters, of the Yoruba race.<\/p>\n<p><strong>NATIONAL MUSEUMS<\/strong><\/p>\n<p><strong>National Museum, Oron, Akwa Ibom State<\/strong><\/p>\n<p>It was established in 1959. The museum is reputed as containing the largest ethnographic gallery in Africa, a craft shop and an African cuisine restaurant.<\/p>\n<p><strong>National Museum Benin City<\/strong><\/p>\n<p>It has a rare collection of antiquities and artifacts of the rich cultural past of the state. The Benin Museum represents the ancient and modern artistic ingenuity of the Edo people and some major cultures of Nigeria.<\/p>\n<p><strong>National Museum Kaduna<\/strong><\/p>\n<p>It is rich with collection of diverse antiquities, artifacts and relics of Nigerian cultural heritage. This is the home of the over 2500 years old Nok Terracotta collections. There are also many other sculptural, craft and art collections in the museum.<\/p>\n<p><strong>National Museum and Monument Lagos<\/strong><\/p>\n<p>It contains some of the country’s rare collections of works of arts and craft, and historic monuments. It is a good place to visit for further discovery about the hardworking people of Lagos and Nigeria.<\/p>\n<p><strong>Museum of Traditional Nigerian Architecture (MOTNA)<\/strong><\/p>\n<p>It is located in the Jos metropolis. It is a museum depicting the diverse traditional Nigerian architecture.<\/p>\n<p><strong>Ife Museum Ile-Ife<\/strong><\/p>\n<p>It dates back to 1930, and houses various objects of antiquity which abound in Ile-Ife from time immemorial. Among important collections in the museum is the granite tools, crubicles fused for making beads, brass of Ooni of Ife, and terracotta art works, etc.<\/p>\n<p><strong>HOTELS AND RESTAURANTS<\/strong><\/p>\n<p>There are several hotels located in different parts of the country. These range from First Class, Second Class and Third Class according to international standard and specification. Hotels activities are regulated by the Nigerian Tourism Development Corporation (NTDC).<\/p>\n<p>Hotels provide job opportunities for the citizens as well as foreigners as they employ both skilled and unskilled workers. Hotels serve as avenue for generating income through support for entertainment industry in the country. For instance, they provide opportunity for music and Nollywood stars to do stage performance. Some notable hotels in the country include Transcorp Hotel, Abuja; Sheraton, Lagos; Continental Hotel, Lagos; Hotel Presidential, Enugu; Premier Hotel, Ibadan and Hamdala Hotel, Kaduna, Eko Hotel, Lagos.<\/p>\n<p><strong>SPORTS AND RECREATION<\/strong><\/p>\n<p>Sports and recreation are fast developing activities in Nigeria, country of an estimated 177.5 million inhabitants, which counts many lovers of sports and adepts of leisure games. Sports have become a unifying factor in Nigeria and an essential ingredient towards nation building. It has facilitated the country’s socio-cultural and ethnic integration. It is actually a very important aspect of Nigeria’s socio-cultural life. It is a medium through which competition, friendship, tolerance, endurance, diplomacy and unity are promoted amongst human beings within nations and internationally, irrespective of race, gender, class and other parameters.  It impacts on many of the individual’s precious personal mementoes and deepest values, male or female.  An analysis of those actively involved in sports in Nigeria indicates that men constitute the greater number either as players, coaches, or as administrators.<\/p>\n<p>Nigerians enjoy a large number of indigenous games and sports. Among the Yoruba, traditional wrestling is popular. Names attached to the various forms of wrestling give some indication of their nature. For example, ija kadi suggests a fight that is a free-for-all and eke suggests wrestling with distinct techniques and rules. The game known outside Nigeria as mancala is very popular. It is known as ayo among the Yoruba, dara among the Hausa, okwe among the Igbo and nsa isong among the Efik. It is a board game for two players, played with seeds or stones.<\/p>\n<p>Sports such as swimming, lawn tennis, table tennis, handball, basketball, squash, cricket, judo, field hockey, weight-lifting and wrestling are supported by the government, corporate bodies and individuals. Wealthy Nigerians in the cities may belong to exclusive clubs, which have facilities for tennis, golf or swimming. A demo- graphic analysis of people actively in sports in Nigeria indicates that men constitute the greater number either as players, coaches or administrators. Expenditure, equipment and facilities for the use of the Sports divisions and its various governing bodies, throughout the country. Stadia are being constructed in many parts of the country.<\/p>\n<p>The Abuja stadium, with capacity of 60,000, an Olympic-size swimming pool, a hockey astroturph and a velodrome has become the national rallying point. Another important stadium is located at Onikan in Lagos, Nigeria’s former Federal capital city. It is worthwhile putting the spotlight on the various sport activities now well established in the country majority of the athletic competitions in the country.<\/p>\n<p><strong>SPORTS PLAYED IN NIGERIA<\/strong><\/p>\n<p>The National Sports Commission promotes about twenty four different sports, each being organized by a non-autonomous governing body. Some of the sports that are played in Nigeria include: Athletics (track and field), Badminton, Baseball, Basketball, Boxing, Chess, Cricket, Cycling, Football (called soccer in the United States and in some other places), Gymnastics, Golf, Handball, Hockey, Judo, Tennis, Rowing, Shooting, Squash rackets, Swimming, Table tennis (called ping-pong in some other places), Taekwondo, Volleyball, Power- lifting,  Wrestling, Traditional sports and a host of other Para- sports (sports for the physically challenged). The Federal, State and Local Governments make funds available for current clubs from different provinces were invited to play. However, the clubs had to wait till 1990 for the professional league to be introduced.<\/p>\n<p>Nigeria emerged on the international football\/soccer scene in 1960 when it first entered the World Cup, but failed to qualify for the finals. It eventually qualified for the 1970 World Cup in Mexico. The Nigerian National League began in 1972 when five teams entered the league. This grew to 12 teams by 1978. By the 1980s, the national football team, the Super Eagles (formerly known as the Green Eagles) had become a team to reckon with at the international level. The Super Eagles was adjudged the best team in Africa and one of the best ten in the world. Nigeria won the first World Cup in the under-16 category in China in 1985 and came second the same category two years later in Canada. Its Under-20 soccer team won the bronze medal in the Junior World Cup competition in the Soviet Union in 1985, the silver medal in Saudi Arabia in 1989 and in the Netherlands in 2005. The national football team, the Super Eagles has won the African Cup of Nations in 1980, 1994 and 2013 and was the finalist three times in the competition.<\/p>\n<p>They reached the second round of the World Cup in 1994, 1998 and 2014. They were crowned Champions (Gold Medal) in Olympic Games in Atlanta, U.S.A in 1996, a performance which Nigerians and many Super Eagles fans across the world will remember for a long time. The under-17 team tutored by Coach Yemi Tella also won the Gold Medal in the 2007 Junior World Cup. The story of the Super Eagles is also that of individual star-players that make the minds of football lovers vibrate, from Rashidi Yekini (RIP), Daniel Amokachi, Mudashiru Lawal, Sunday Oliseh, Taribo West, Samson Siasia, Tijani Babangida, Victor Ikpeba, Stephen Keshi, George Finidi, Emmanuel Amunike, Celestine Babayaro, Victor Agali, Peter Odemwinge, Mikel Obi to Austin Okocha and Kanu Nwankwo; among others. The Super Eagles are now ranked among the best teams, not only in Africa but in the world. They put up an impressive performance in the 2014 World Cup championship in Brazil, attaining the second round.<\/p>\n<p>Nigeria also boasts of a strong Women’s football team, the Super Falcons, which, as of 2007, has won the seven editions of the African Women’s Football championship organised since the creation of this championship in 1991. Drivenby talented players like Florence Omogbemi, Ajuma Ameh, Anne Chiejine, and Effionanwan Ekpo, among others. The Women’s team also reached the quarter final of the 1999 Women’s foot- ball World Cup and the 2004 Olympic Games.<\/p>\n<p>&nbsp;<\/p>\n<p>source: <a href=\"https:\/\/nigeria.gov.ng\/about-nigeria\/nigerian-culture\/\">https:\/\/nigeria.gov.ng\/about-nigeria\/nigerian-culture\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>NIGERIA CULTURE AND HERITAGE The Nigerian government in September, 1988, launched the “National Cultural Policy”. This policy document defined culture as “ the totality of the way of life evolved by a people in their attempt to meet the challenges in their environment which gives order and meaning to their social, political, economic, aesthetic and [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":248064,"parent":133,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"acf":[],"_links":{"self":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/137"}],"collection":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/comments?post=137"}],"version-history":[{"count":4,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/137\/revisions"}],"predecessor-version":[{"id":248682,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/137\/revisions\/248682"}],"up":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/133"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media\/248064"}],"wp:attachment":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media?parent=137"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}