{"id":143,"date":"2022-03-12T14:12:38","date_gmt":"2022-03-12T14:12:38","guid":{"rendered":"https:\/\/foreignaffairs.gov.ng\/?page_id=143"},"modified":"2023-04-18T14:35:15","modified_gmt":"2023-04-18T14:35:15","slug":"investment","status":"publish","type":"page","link":"https:\/\/foreignaffairs.gov.ng\/nigeria\/investment\/","title":{"rendered":"Investment"},"content":{"rendered":"<p><strong>INVEST IN NIGERIA<\/strong><\/p>\n<p>Nigeria was proclaimed Africa’s largest economy in 2014, following the rebased calculation of its Gross Domestic Products – GDP to capture hitherto undervalued or neglected sectors such as its flourishing entertainment industry (Nollywood and Nigerian Music) and Information and Communications Technology – ICT. Nigeria’s GDP then totaled over 510 billion dollars. The GDP has also been registering an impressive growth rate in recent years, exceeding 6% annually. Nigeria is one of Africa’s most attractive destinations for investors. Besides the diverse natural resources it is endowed with, Nigeria disposes of a huge human capital, with trained and qualified professionals readily available at competitive costs in the employment market. Investors would also be impressed by the array of investment incentives they can take advantage of in various sectors. Nigeria, investors would quickly discover, is a market characterised by the high return on investment it offers. Nigeria’s investment environment is supported by strong and reliable financial institutions and government agencies.<\/p>\n<p><strong>NIGERIAN INVESTMENT PROMOTION COMMISSION<\/strong><\/p>\n<p>The Nigerian Investment Promotion Commission (NIPC) is a Federal Agency charged, among others, with coordinating, monitoring and providing necessary assistance and guidance for the establishment and operation of enterprises in Nigeria. It is not only the gateway to investment in Nigeria for foreign investors and Nigerian investors seeking to engage in value-added activities in their country, but also Nigeria’s window to the international investment world. It is a Federal Agency with a perpetual succession and a common seal. NIPC collects, collates, analyze and disseminates information and data on investment opportunities and sources of capital. It advises on business partnership and identifies specific projects in which potential investors can be solicited to participate.<\/p>\n<p>The NIPC registers and keeps records of all companies to which the NIPC Act applies. It maintains the interaction between investors and ministries, government departments and agencies, financial institutions and other authorities concerned with investments. It anchors the One-Stop Investment Centre (OSIC) which interfaces with companies on incorporation and registration matters.  <a href=\"http:\/\/www.nipc.gov.ng\" target=\"_blank\" rel=\"noopener noreferrer\">www.nipc.gov.ng<\/a><\/p>\n<p><strong>ONE STOP INVESTMENT CENTRE-OSIC<\/strong><\/p>\n<p>Established in 2006 within the framework of the Nigerian Investment Promotion Commission (NIPC), One-Stop Investment Centre (OSIC), as its name indicates, is an organ set up to facilitate investment in all sectors of Nigeria’s economy. It provides a single portal or contact point for sourcing information and carrying out the necessary formalities with a view to obtaining all the required approvals before the operation of a business. OSIC brings together the divers services normally provided separately by various government agencies involved in company registration and operations formalities. It is a point of convergence for coordinated and streamlined action. The centre also assists existing and prospective investors with statistical data and information on the Nigerian economy, investment climate, legal and regulatory framework, as well as sector and industry- specific information, to facilitate the making of informed business decisions.<\/p>\n<p>Services offered by OSIC include:<\/p>\n<p>• Providing general information and data on Nigeria’s economy, as well as advisory services on investment opportunities;<br \/>\n•Granting of business entry approvals, permits and authorisations;<br \/>\n•Assisting with company incorporation and registration;<br \/>\n•Facilitating post-entry approvals, licences and other sector-specific permits with statutory government agencies with extant mandate;<br \/>\n• Assisting with tax registration and clearance;<br \/>\n• Assisting with work permit, expatriate quota and other immigration formalities;<br \/>\n• Facilitating Customs clearance for investment projects. OSIC brings together, for speedy service delivery, several agencies and ministries, among others.<\/p>\n<p><strong>BUSINESS INCORPORATION AND REGISTRATION: A MANDATORY REQUIREMENT<\/strong><\/p>\n<p>All businesses in Nigeria must be registered with the Corporate Affairs Commission before going formally into operation. Registration can take various forms as follows, depending on the type of business:<br \/>\n•Private Limited Liability Company (Ltd)<br \/>\n•Public Limited Company (PLC)<br \/>\n•Unlimited Company<br \/>\n•Company Limited by Guarantee<br \/>\n•Subsidiary or Branch of a foreign company<br \/>\n•Partnership or Joint Venture<br \/>\n•Sole Proprietorship<br \/>\n•Incorporated Trustees (religious, charitable, philanthropic or cultural)<br \/>\n• Representative Office (in special cases)<\/p>\n<p>A minimum share capital of Ten Thousand Naira (N10 000) is required to set up a private company (Limited Liability). For a Public Company (PLC) the required minimum share capital is five hundred thousand naira, (500,000 Naira). A minimum subscription of 25% of the authorised capital is also required at the point of incorporation.<\/p>\n<p><strong> Company Registration Process<\/strong><\/p>\n<p>Company Registration process has been streamlined and simplified to enhance efficiency and rapidity, with the establishment of the One-Stop Investment Centre (OSIC), located in the premises of the Nigerian Investment Promotion Commission (NIPC). Through the services of OSIC, companies can now be registered in a matter of days. However, companies which so wish can engage the services of a legal counsel to perform the registration formalities, although this may attract a substantial fee. The following are the main steps in the process of company registration:<\/p>\n<p>• Prepare the Memorandum and Articles of Association of the proposed company.<br \/>\n• Conduct at the Corporate Affairs Commission availability search on the proposed name of the company; once the company name is approved, a set of incorporation forms should be purchased and filled; the registration of business name can be conducted without the assistance of a legal practitioner and attracts a fee of 10,000 Naira (Ten Thousand Naira).<br \/>\n• Submit appropriate documents to the Federal Inland Revenue Service for payment of stamp duties and stamping.<br \/>\n• Submit the completed and stamped documents with together with the corresponding permits to the CAC for verification and final approval.<br \/>\n•The Certificate of Incorporation is then issued, with the accompanying Certified True Copies of relevant documents to the investor. All post-registration processes are done at the Head Office of the Corporate Affairs Commission (CAC) where all files are kept in safe custody and data entered on the CAC records.<\/p>\n<p><strong>Incorporating and Operating a foreign Company<\/strong><\/p>\n<p>Foreign companies wishing to establish and operate in Nigeria must accomplish required formalities for the local incorporation of the Nigerian branch or subsidiary, or autonomous business entity. Prior registration must be done before embarking on any business activity. An investor may, however, give power of attorney to a solicitor for a limited period of time during which incorporation is being processed. This arrangement would then be indicated in the relevant incorporation documents, specifying that the solicitor, whose name appears therein, is merely acting as an “Agent” or “Principal”. The appointed solicitor ceases to function in the specified capacity upon the completion of the registration formalities. The locally incorporated company must then register with the Nigerian Investment Promotion Commission (NIPC) before commencing formal operations. It may also apply to NIPC for other investment approvals (expatriate quota, etc.) and incentives ((Pioneer Status, etc.).<\/p>\n<p><strong>Exemption from Incorporation<\/strong><\/p>\n<p>Where applicable, exemption from local incorporation may be granted in accordance with Section 56 of the Companies and Allied Matters Act. Application to this effect should be addressed to the National Council of Ministers, through the Secretary to the Government of the Federation (SGF). The National Council of Ministers eventually grants the exemption in the terms it deems fit. Below are the concerned categories of businesses:<\/p>\n<p>• Foreign Companies which are in Nigeria for the execution of a specific individual loan project on behalf of a donor country or an international organisation;<br \/>\n• Foreign government-owned companies engaged solely in export promotion activities; • Engineering consultants and technical experts on any individual specialist project  under contract with any of the governments of the Federation or any of their agencies or with any other body or person, where such contract has been approved by the government.<\/p>\n<p><strong>CORPORATE AFFAIRS COMMISSION (CAC)<\/strong><\/p>\n<p>The Corporate Affairs Commission (CAC) was established by the Companies and Allied Matters Act (1990) as an autonomous body to regulate the formation and management of companies in Nigeria. The Commission dispenses a wide range of services before, during and after incorporation and registration of business enterprises. It administers the Companies and Allied Matters Act promulgated in 1990 and commonly called the “Companies Act”. It is headed by a Registrar General\/ Chief Executive Officer.<\/p>\n<p>Among the functions and services offered by the Corporate Affairs Commission Headquarters are:<br \/>\n• Registration of business name and incorporation of companies;<br \/>\n• Registration of Incorporated Trustees;<br \/>\n• Same Day Incorporation Services, whereby, under certain conditions, companies can be registered within one day;<br \/>\n• Issuance of True Certified Copies of filed company documents;<br \/>\n• Registration of share capital increases, mortgages, etc.;<br \/>\n• Processing the statutory filings of Annual Returns, increase, changes in the memo and articles, addresses, etc.<br \/>\n• Management and winding- up of companies.<\/p>\n<p>The Corporate Affairs Commission has branch offices in all the 36 states of the Federation. It enjoys accreditation for ISO 9001 for its services.         <a href=\"http:\/\/www.cac.gov.ng\" target=\"_blank\" rel=\"noopener noreferrer\">www.cac.gov.ng<\/a><\/p>\n<p><strong>Representative Offices <\/strong><\/p>\n<p>A foreign company may set up representative office in Nigeria. However, such an office can only serve as a pro- motional and liaison office and its local expenses have to be covered by the foreign company. It cannot engage in business activities or conclude contracts or open or negotiate any letters of credit.<\/p>\n<p><strong>Legislation On Investment<\/strong><\/p>\n<p>Two principal laws govern investment in Nigeria, with emphasis on foreign investment: •The Nigerian Investment Promotion Act N° 16 of 1995;<\/p>\n<p>•The Foreign Exchange (Monitoring and Miscellaneous Provisions) Act N°17 of 1995. The functions Nigerian Investment Promotion Commission (NIPC), as stipulated by the NIPC Act 16, 1995, are wide-ranging and include coordinating, monitoring, encouraging and providing necessary assistance to and guidance for the establishment and operation of businesses in Nigeria. The NIPC is also to promote investment in and outside Nigeria through effective means. The highlights of the above- mentioned Acts (N°16 and N° 17 of 1995) with regards to investment are as follows:<br \/>\n• A foreigner may invest and participate in the operation of any enterprise in Nigeria; •An enterprise in which foreign participation is permitted shall, after its incorporation, be registered with the NIPC;<br \/>\n• A foreign enterprise may buy shares of any Nigerian enterprise in any convertible currency;<br \/>\n• A foreign investor in a registered enterprise is guaranteed unconditional transferability of funds through an authorised dealer, in any convertible currency, be it: – dividends or profit (net of taxes) attributable to the investment; – payments in respect of loan servicing, where a foreign loan has been obtained; – proceeds (net of taxes and other obligations) in the event of sale or liquidation of enterprise or any interest attributable to the investment; – the entire capital can be transferred should the investor decide to relocate elsewhere.<\/p>\n<p><strong>Investment  Protection<\/strong><\/p>\n<p>The legislation on investment also provides solid assurance regarding the protection of investment. It guards against nationalisation or expropriation of an enterprise by the government and the compulsory dispossession of an investor of his\/her interest in the capital of an enterprise, whether wholly or in part. It guards against the acquisition of an enterprise by the government unless the such an acquisition is in the best interest of a public purpose, in which case adequate compensation must be paid promptly, with authorisation for full repatriation of the proceeds in convertible currency, where applicable. The law also gives the investor the right of access to the courts for determination of his\/her interest of right and the compensation to which he\/she is entitled.<\/p>\n<p><strong>Investment Promotion and Protection Agreements<\/strong><\/p>\n<p>Countries willing to invest in Nigeria may choose to enter into bilateral Investment Promotion and Protection Agreement (IPPA) with the Nigerian government. Deregulation of Equity Structure in Nigerian Enterprises<br \/>\nThe Nigerian Investment Promotion Commission (NIPC) Act N° 16 of 1995 has effectively abolished any restrictions in respect of the limits of foreign shareholding in an enterprise registered in Nigeria. However, certain categories of enterprises remain subject to authorisation for non-Nigerians:<br \/>\n• Production of arms and ammunition;<br \/>\n• Production of and dealing innarcotics and psychotropic substances;<br \/>\n• Manufacture of military and paramilitary wears and accoutrements;<br \/>\n• Participating in coastal and inland shipping.<\/p>\n<p><strong>ROLE OF THE FINANCIAL SYSTEM<\/strong><\/p>\n<p>The Federal Ministry of Finance (FMF) and the Central Bank of Nigeria (CBN) are the primary institutions regulating the Nigerian financial system as regards investment. The financial system comprises bank and non-bank institutions. Other institutions involved in the regulation of the financial system include the Nigerian Deposit Insurance Corporation (NDIC), Security and Exchange Commission (SEC), National Insurance Commission (NAICOM), Federal Mortgage Bank of Nigeria (FMBN) and the National Board for Community Banks.<\/p>\n<p><strong>FEDERAL MINISTRY OF FINANCE<\/strong><\/p>\n<p>The Federal Ministry of Finance (FMF) is the central regulatory organ of the Nigerian financial system.  It advises the Federal Government on its fiscal policies and operations, and monetary matters generally, in con- junction with the Central Bank of Nigeria (CBN). <a href=\"http:\/\/www.fmf.gov.ng\" target=\"_blank\" rel=\"noopener noreferrer\">www.fmf.gov.ng<\/a><\/p>\n<p><strong>CENTRAL BANK OF NIGERIA<\/strong><\/p>\n<p>The Central Bank of Nigeria (CBN) is the apex regulatory authority of the financial system established in 1958, the Bank promotes monetary stability and a sound financial system. Its powers have been expanded since 1991 to regulate and oversee the banking sector. It also licenses banks and finance companies. CBN  <a href=\"http:\/\/www.cenbank.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.cenbank.org<\/a><\/p>\n<p><strong> NIGERIAN DEPOSIT INSURANCE CORPORATION<\/strong><\/p>\n<p>The Nigerian Deposit Insurance Corporation (NDIC) provides deposit insurance and ancillary services to banks so as promote confidence in the banking industry. It is therefore empowered to examine the books of insured banks and financial institutions receiving deposits. It guarantees the depositor a certain amount in the event of bank failure. Though autonomous, the NDIC complements the regulatory and supervisory role of the Central Bank of Nigeria.<\/p>\n<p><a href=\"http:\/\/www.ndic-ng.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.ndic-ng.com<\/a><\/p>\n<p><strong>SECURITIES AND EXCHANGE COMMISSION<\/strong><\/p>\n<p>Main regulatory organ of the capital market, the Securities and Exchange Commission is<br \/>\nMaintains surveillance over the market to enhance efficiency and ensure discipline. It regulates and approves mergers and acquisitions.<\/p>\n<p><a href=\"http:\/\/www.secngr.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.secngr.org<\/a><\/p>\n<p><strong>NATIONAL INSURANCE COMMISSION<\/strong><\/p>\n<p>The National Insurance Commission (NAICOM) is charged with the administration, supervision and regulation of the insurance business in Nigeria. It protects insurance policy holders, precisely through a bureau established to receive and attend to com- plaints by members of the public against insurance companies and their agents.<\/p>\n<p><a href=\"http:\/\/www.naicomonline.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.naicomonline.org<\/a>.<\/p>\n<p><strong>THE MONEY MARKET<\/strong><\/p>\n<p>The Money Market is a mechanism which facilitates the raising of short-term funds from the surplus sectors of the economy to the deficit sectors. The deficit sectors which could be public or private, obtain funds from the market to bridge budgetary gaps by either engaging in interbank taking or trading in short-term securities such as Treasury Bills, Treasury Certificates, Call Money, Certificates of Deposit (CD) and Commercial Papers (CP). With the commencement of the Open Market by the Central Bank of Nigeria, the scope of the Money Market has been expanded. The number of participants has also increased with the establishment of discount Houses. Money Market institutions include Discount Houses, Commercial Banks, special purpose banks such as Agricultural Cooperative and Rural Development Bank, as well as Micro-Finance Banks.<\/p>\n<p><strong>DISCOUNT HOUSES<\/strong><\/p>\n<p>Discount Houses are non-bank financial institutions which intervene in mobilising funds for investment in securities in response to the liquidity of the system. This is achieved by providing discount\/rediscounting facilities in government short-term securities. Discount houses serve as financial intermediaries between the Central Bank of Nigeria, licensed bank and other financial institutions. First Securities Discount House Ltd, Express Discount House Ltd, Associated Discount House Ltd, Kakawa Discount House Ltd and Consolidated Discount House Ltd, are among the Discount Houses currently in operation.<\/p>\n<p><strong>DEBT MANAGEMENT OFFICE<\/strong><\/p>\n<p>The Debt Management Office was established as an autonomous body to address the problems of debt. It centralizes debt management functions in one single agency, to ensure proper coordination. These functions include debt recording, debt service forecasts and payments, debt negotiations and borrowings.  DMO  <a href=\"http:\/\/www.dmonigeria.com\" target=\"_blank\" rel=\"noopener noreferrer\">www.dmonigeria.com<\/a><\/p>\n<p><strong>FEDERAL INLAND REVENUE SERVICE<\/strong><\/p>\n<p>The Federal Inland Revenue Service (FIRS) is a major contributor to the Nigerian financial system. It is an agency which processes all tax-related matters (tax registration, tax collection and management, issuance of tax clearance certificate and payment of stamp duties, etc.).<\/p>\n<p><a href=\"http:\/\/www.firs.gov.ng\" target=\"_blank\" rel=\"noopener noreferrer\">www.firs.gov.ng<\/a>.<\/p>\n<p><strong>BANK OF AGRICULTURE<\/strong><\/p>\n<p>The Bank of Agriculture, formerly Nigerian Agricultural Cooperative and Rural Development Bank (NACRDB) came into being through the merger in 2000 of the Nigerian Agricultural and Cooperative Bank (founded in 1973), the People’s Bank of Nigeria and the risk assets of the Family Economic Advancement Programme (FEAP). The name Bank of Agriculture was adopted in 2010. Owned by the Federal Government (Federal Ministry of Finance 60% and Central Bank of Nigeria 40%), the BOA now stands as the single largest development institution in Nigeria. It operates three main types of loan schemes:<br \/>\n• Small holder loan scheme: subsidised credit scheme for small scale farmers and enterprises;<br \/>\n• Large-scale or Investment Loan Scheme: for medium and large-scale farmers and enterprises; requires a proper investment appraisal by the borrower;<br \/>\n• On-lending scheme: provision of wholesale credit to other on-lending agents (apex- credit bodies, cooperatives, government institutions) The bank’s main source of fun- ding are the Federal Government of Nigeria, inter- national development agencies, equity and deposit accounts.<\/p>\n<p><a href=\"http:\/\/www.boanig.com\" target=\"_blank\" rel=\"noopener noreferrer\">http:\/\/www.boanig.com<\/a><\/p>\n<p><strong>BANK OF INDUSTRY<\/strong><\/p>\n<p>The Bank of Industry (BOI) is an offshoot of the Nigerian Industrial Development Bank (NIDB) which was incorporated in 1964. It is one Nigeria’s oldest development financing institutions. It came into being in its present form in 2001, following the restructuring of NIDB.  The core mandate of Bank of Industry (BOI) is to provide financial assistance for the establishment of large, medium and small projects; as well as expansion, diversification and modernization of existing enterprises; and rehabilitation of ailing industries.<\/p>\n<p><a href=\"http:\/\/www.boi.ng\/\" target=\"_blank\" rel=\"noopener noreferrer\">http:\/\/www.boi.ng\/<\/a><\/p>\n<p><strong>BUSINESS ETHICS AND CONDUCT, PRODUCT CONTROL<\/strong><\/p>\n<p>Several institutions are charged with the control of business operations and products to ensure compliance with the law as regards business ethics and con- duct and quality standards. They include the Standards Organisation of Nigeria, National Agency for Foods and Drugs Administration and Control, Economic and Financial Crimes Commission and Independent Corrupt Practices and other related Offences Commission.<\/p>\n<p><strong>STANDARD ORGANISATION OF NIGERIA<\/strong><\/p>\n<p>The Standards Organisation of Nigeria is empowered to enforce standards, quality control of products, science of measurement and all matters relating to metrology. It also has powers to designate, establish and approve standards in respect of metrology, materials, commodities, structures and processes for the certification of products in commerce and industry throughout Nigeria. SON has branches spread across the Federation; it set up and operates the Mandatory Conformity Assessment Programme. It also put in place the SONCAP process, used to verify that products to be imported into Nigeria are in conformity with the applicable NIS or approved equivalents and technical regulations before shipment. The Standards Organisation of Nigeria is headed by a Director General. SON www.<a href=\"mailto:info@son.gov.ng\" target=\"_blank\" rel=\"noopener noreferrer\">son.gov.ng<\/a><\/p>\n<p><strong>NATIONAL AGENCY FOR FOODS AND DRUGS ADMINISTRATION AND CONTROL<\/strong><\/p>\n<p>The National Agency for Food and Drug Administration and Control (NAFDAC) is a parastatal established in 1993 under the Federal Ministry of Health and charged with verifying the compliance of all food products, drinks and drugs produced and distributed in Nigeria, imported into or exported from the country, with established quality standards and specifications, which guarantee fitness for human or animal consumption as the case may be. Such products must be declared to NAFDAC for testing, approval and registration before being introduced into the market. The registration number delivered for each product must be printed on its package for easy check by consumers. Recently, the registration number features in a bar code that consumers can photograph with a cell phone camera and text to given number, then instant feedback will be received indicating if the product is approved by NAFDAC or not. NAFDAC is responsible for authorising (controlling) the importation and exportation of Narcotic drugs, psychotropic and other controlled substances, to ensure that their use is limited to medical and scientific purposes.<\/p>\n<p><a href=\"http:\/\/www.nafdac.gov.ng\" target=\"_blank\" rel=\"noopener noreferrer\">www.nafdac.gov.ng<\/a><\/p>\n<p><strong>NIGERIAN CONTENT NCDMB NIGERIAN CONTENT DEVELOPMENT AND MONITORING BOARD  <\/strong><\/p>\n<p>Nigerian Content is the quantum of composite value added or created in the Nigerian economy through the utilisation of Nigerian human and material resources for the provision of goods and services to the petroleum industry within acceptable quality, health, safety and environment standards in order to stimulate the development of indigenous capabilities. The Nigerian Content Development Board, headed by an Executive Secretary, is charged with enforcing the Nigerian Content Policy. Established in 2010, the Nigerian Content Development and Monitoring Board (NCDMB) is saddled with the following responsibilities, among others:<br \/>\n• Increase indigenous participation in the oil and gas industry,<br \/>\n• Build local capacity and competencies,<br \/>\n•Create linkages to other sectors of the national economy;<br \/>\n• Boost industry contributions to the growth of our National Gross Domestic Product. Investors are strongly encouraged to take cognisance of Nigerian content dispositions that may apply to their field of activity, particularly in the oil sector, as they go into operation.<\/p>\n<p><a href=\"http:\/\/www.ncdmb.gov.ng\">www.ncdmb.gov.ng<\/a><\/p>\n<p><strong> NIGERIAN DRUG LAW ENFORCEMENT AGENCY  <\/strong><\/p>\n<p>Established in 1990, the National Drug Law Enforcement Agency – NDLEA is charged with the elimination of the production, processing, selling, exporting, importing and trafficking of hard drugs.<\/p>\n<p>Nigerian Drug policies are streamlined with the international conventions such as the 1961 Convention on Narcotic Drugs as amended by the 1972 Protocol, the 1971 Convention on Psychotropic Substances and the 1988 Convention against Illicit Traffic of Narcotic and Psychotropic Substances. While pursuing its actions to arrest carriers of illicit drugs, the NDLEA is also focusing on the controlling members of narcotics and money laundering organisations. NDLEA Contact: www.<a href=\"mailto:info@ndlea.gov.ng\">ndlea.gov.ng<\/a><\/p>\n<p><strong>ECONOMIC AND FINANCIAL CRIMES COMMISSION AND  INDEPENDENT CORRUPT PRACTICES AND OTHER RELATED OFFENCES COMMISSION<\/strong><\/p>\n<p>Two government agencies are charged with spearheading the fight against corruption and financial crimes: the Economic and Financial Crimes Commission – EFCC, set up in 2004, and the Independent Corrupt Practices and Other Related Offences Commission (ICPC), established in 2000. They are empowered to initiate investigation into reported cases of corruption and financial malpractice and engage legal action against the individuals involved. Besides, their missions include the prevention of such illegal acts. The ICPC is specifically charged with handling corruption and financial crimes involving government officials and other public service officers. The EFCC has been very active in the war against money laundering and the famous “Advance Fee Fraud”, commonly called “419” scam, in reference to the decree made to combat it. Advance fee frauds are proposals by swindlers to transfer huge sums of money into the bank accounts of their would be victims, who would be rewarded for their cooperation with attractive commissions, but from whom in reality money would be extorted without any services rendered. <a href=\"http:\/\/www.efcc.org\" target=\"_blank\" rel=\"noopener noreferrer\">www.efcc.org<\/a> and <a href=\"http:\/\/www.icpc.gov.ng\" target=\"_blank\" rel=\"noopener noreferrer\">www.icpc.gov.ng<\/a> ■<\/p>\n","protected":false},"excerpt":{"rendered":"<p>INVEST IN NIGERIA Nigeria was proclaimed Africa’s largest economy in 2014, following the rebased calculation of its Gross Domestic Products – GDP to capture hitherto undervalued or neglected sectors such as its flourishing entertainment industry (Nollywood and Nigerian Music) and Information and Communications Technology – ICT. Nigeria’s GDP then totaled over 510 billion dollars. The [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":248087,"parent":133,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"acf":[],"_links":{"self":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/143"}],"collection":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/comments?post=143"}],"version-history":[{"count":3,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/143\/revisions"}],"predecessor-version":[{"id":248668,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/143\/revisions\/248668"}],"up":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/133"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media\/248087"}],"wp:attachment":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media?parent=143"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}