{"id":145,"date":"2022-03-12T14:14:58","date_gmt":"2022-03-12T14:14:58","guid":{"rendered":"https:\/\/foreignaffairs.gov.ng\/?page_id=145"},"modified":"2023-04-18T14:34:24","modified_gmt":"2023-04-18T14:34:24","slug":"nigeria-economy","status":"publish","type":"page","link":"https:\/\/foreignaffairs.gov.ng\/nigeria\/nigeria-economy\/","title":{"rendered":"Economy"},"content":{"rendered":"<p><strong>Background of the Nigerian Economy<\/strong><\/p>\n<p>Nigeria is the largest economy in Africa, with a GDP greater than USD 500 billion and steadily grew to over 7 percent per annum between 2005 and 2014, but this growth has being slower in 2015. This growth was driven primarily by the non-oil sectors, such as financial services, telecommunications, entertainment, etc. Foreign direct investment (FDI) inflows have been strong, averaging USD2 billion per quarter since 2013, with over 70percent of this in the non-oil sectors. Nigeria’s economy is actually more diversified than it seems, with the Oil sector contributing only about 14percent to GDP. Nevertheless, we ought to be doing more to diversify with the significant natural and human resources with which Nigeria is blessed. There is no doubt that Oil has contributed substantially to Nigeria’s revenue since its discovery in 1956 and more especially, since 1970 when its price was on the upward trend. Yet, oil receipts and their management have challenged governance to the core over time in Nigeria. Deeper economic diversification is an urgent necessity to undertake structural transformation, buffer the domestic economy from externally transmitted shocks and accelerate growth accompanied by job creation.<\/p>\n<p><strong>Current Diversification Efforts<\/strong><\/p>\n<p>The task ahead of further diversification of the economy is enormous, which is not taken for granted. There are three categories or sectors that the present administration has put in effort in diversifying the economy:<\/p>\n<ul>\n<li>   First, the Telecommunications sector: we have seen an increase in the number of telephone lines available in the country from about four hundred thousand (400,000) lines in 2001 to over one hundred and forty million (140,000,000) lines currently, because of the deregulation policy of the government. According to the Nigerian Communication Commission, the operators in the sector have created over one million – direct and indirect jobs and helped to attract over $USD twenty five billion ($USD25 BN). The success of the telecommunication sector, especially mobile telephony, has helped develop other ancillary sectors like e-commerce, entertainment (what we call Nollywood), among others. The World Trade Organization has recognized the standards being set by the Nigerian entertainment industry Nollywood and has reflected it on the Programme Cover for this Round Table.<\/li>\n<li>   Second, the financial services sector: We have seen the strong growth of the financial services sector since the liberalization exercise that started in 1990. The exercise continued in 2005, with the guidance of the financial regulatory body Central Bank of Nigeria (CBN) and there were market-led mergers and acquisitions that reduced the number of banks from eighty-nine (89) to twenty-four. The banks came out of the exercise bigger, with better corporate governance and have now started to operate across Africa, financing larger transactions. The market-led business combinations served as a catalyst for the stock exchange’s growth, which has grown to a market capitalization of over fifty billion dollars (USD$50 BN).<\/li>\n<li>    Third, the cement sector. In spite of the abundant supply of limestone, the major constituent for making cement, Nigeria primarily imported the product for our building needs. The government however implemented a backward integration agenda that has now translated the country from being a net importer to a net exporter of the product.<\/li>\n<\/ul>\n<p>The success that has been recorded in growing these three sectors, which is used as an examples have some basic underlying elements in common – the right enabling environment including appropriate regulation; policy consistency; and fostering competition among the industry operators. The administration will build on these elements to develop sectors where Nigeria has comparative advantage to foster more diversification of the economy. Althought the task of further diversification of the economy is herculean, but Nigeria’s short and medium term prospects remain favorable (driven by strong fundamental advantages). Four of the strongest advantages are – Strong demographics, with a large domestic market and labor force; abundant natural resources and favorable climate; a developing financial sector with strong management teams (and ability to partner with international banks to fund businesses); and growing democratic institutions with the political will to build the foundation for the future.<\/p>\n<p><strong>Further Diversification Plans<\/strong><\/p>\n<p>Other plans to continue in fostering the diversification of the economy is predicated on three major underlying elements – implementing our industrialization plan, improving the ease of doing business and building out our infrastructure – both hard and soft infrastructure.<\/p>\n<ul>\n<li>    The Nigeria Industrial Revolution Plan (NIRP) launched in 2012 under the auspices of the Ministry of Industry, Trade and Investment provides a strategic and integrated roadmap towards industrialization. NIRP provides an actionable plan across three sectors: agro-allied, solid minerals and Oil and Gas-related industries, where Nigeria’s comparative and competitive advantage are apparent. We will build on this plan, reviewing and updating, based on current realities while focused on implementing pragmatically and adapting as necessary as we forge ahead.<\/li>\n<li>    Improving the operating environment for small, medium and large corporate businesses to thrive. This will require inter-ministerial coordination and eliminating the bottlenecks that impede doing business in Nigeria. This is a high priority for the current Nigerian government, with a strong commitment to bring change on all the needed levels. We are keen to remove the inhibitions and obstacles to investment in Nigeria. Trade and investment policies, laws and incentives are being reviewed, to bring them in line with global best practices. We will be leveraging technology to improve the speed and efficiency of business procedures, and to ensure transparency.<\/li>\n<li>    Modern and efficient infrastructure is key to promoting diversification and economic growth. Industries require a steady supply of electricity to function optimally, just as agricultural and mining products require robust, efficient and cost-effective transport networks to reach markets. The government is creating an ambitious national infrastructure fund, to complement the existing infrastructure component of the Sovereign Wealth Fund. This is consistent with our national infrastructure master-plan, aimed at catalyzing economic activity.<\/li>\n<\/ul>\n<p>Diversification is a priority of President Buhari’s administration. No nation grows without developing and expanding its productive base, the current administration will strive to create a conducive environment for domestic and foreign trade and investment, especially focused on the non-oil economy. The administration is committed to improving the ease of doing business in the country, as well as continuous partnership with other countries and international organisations like WTO to achieve win-win economic growth and improve the welfare of Nigerian.<\/p>\n<p>Source: <a href=\"http:\/\/fmiti.gov.ng\/index.php\/184-diversifying-africa-s-largest-economy\">http:\/\/fmiti.gov.ng\/index.php\/184-diversifying-africa-s-largest-economy<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Background of the Nigerian Economy Nigeria is the largest economy in Africa, with a GDP greater than USD 500 billion and steadily grew to over 7 percent per annum between 2005 and 2014, but this growth has being slower in 2015. This growth was driven primarily by the non-oil sectors, such as financial services, telecommunications, [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":248065,"parent":133,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"acf":[],"_links":{"self":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/145"}],"collection":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/comments?post=145"}],"version-history":[{"count":2,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/145\/revisions"}],"predecessor-version":[{"id":248665,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/145\/revisions\/248665"}],"up":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/133"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media\/248065"}],"wp:attachment":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media?parent=145"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}