{"id":248683,"date":"2022-05-28T04:35:21","date_gmt":"2022-05-28T04:35:21","guid":{"rendered":"https:\/\/foreignaffairs.gov.ng\/?page_id=248683"},"modified":"2023-04-18T14:39:04","modified_gmt":"2023-04-18T14:39:04","slug":"the-people","status":"publish","type":"page","link":"https:\/\/foreignaffairs.gov.ng\/nigeria\/the-people\/","title":{"rendered":"The People"},"content":{"rendered":"<p>Nigerian people are citizens and people with ancestry from Nigeria. Nigeria is composed of multiple ethnic groups and cultures and the term Nigerian refers to a citizenship-based civic nationality. Nigerians derive from over 250 ethnic groups and languages. Though there are multiple ethnic groups in Nigeria, economic factors result in significant mobility of Nigerians of multiple ethnic and religious backgrounds to reside in territories in Nigeria that are outside their ethnic or religious background, resulting in the intermixing of the various ethnic and religious groups, especially in Nigeria’s cities. The English language is the lingua franca of Nigerians. About 50 percent of Nigerians are Muslims and the other 50 percent are Christians.<\/p>\n<p>The largest groups are the Hausa in the north, the Yoruba in the southwest and the Igbo (or Ibo) in the southeast, who account for around a fifth of the population each. The languages of these three groups can therefore be used in government. Other large groups include the Ijaw in the east and the Fulani in the north.<\/p>\n<p>Nigeria is divided into 36 states, in the 13 northern states; the vast majority of people are Muslim. The Hausa have been Muslims for almost a thousand years, having been converted to Islam by Arab traders and merchants from the 10th century. In the southern states, the majority of Nigerians are Christian, while some groups continue to practice indigenous beliefs. Generally, religion is taken very seriously, most people will attend church on a Sunday and make frequent references to God or Jesus in everyday conversation. Southern indigenous faiths centre on a belief in spirits and also in a Supreme Being or creator, known as Olorun\/Olodumare in Yoruba culture and Chineke\/Chukwu by Igbo people.<\/p>\n<p>The dominant indigenous languages of the south are Yoruba and Igbo while the north is Hause. Prior to colonization, these languages were the unifying languages of the southwest, southeast and north, respectively, regardless of ethnicity. However, since the coming of the British and the introduction of mission schools in southern Nigeria, English has become the language common to most people in the area. Today those who are not ethnic Yorubas, Hausa, Igbos rarely speaks any of the language.<\/p>\n<p>Pidgin, a mix of African languages and English, also is common throughout southern Nigeria. It basically uses English words mixed into Yoruba or Igbo grammar structures. Pidgin originally evolved from the need for British sailors to find a way to communicate with local merchants. Today it is often used in ethnically mixed urban areas as a common form of communication among people who have not had formal education in English.<\/p>\n<p>&nbsp;<\/p>\n<p>source: <a href=\"https:\/\/nigeria.gov.ng\/about-nigeria\/people-of-nigeria\/\">https:\/\/nigeria.gov.ng\/about-nigeria\/people-of-nigeria\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Nigerian people are citizens and people with ancestry from Nigeria. Nigeria is composed of multiple ethnic groups and cultures and the term Nigerian refers to a citizenship-based civic nationality. Nigerians derive from over 250 ethnic groups and languages. Though there are multiple ethnic groups in Nigeria, economic factors result in significant mobility of Nigerians of [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":248686,"parent":133,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"acf":[],"_links":{"self":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/248683"}],"collection":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/comments?post=248683"}],"version-history":[{"count":2,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/248683\/revisions"}],"predecessor-version":[{"id":248685,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/248683\/revisions\/248685"}],"up":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/pages\/133"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media\/248686"}],"wp:attachment":[{"href":"https:\/\/foreignaffairs.gov.ng\/wp-json\/wp\/v2\/media?parent=248683"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}